Link soal : https://www.richardtwatson.com/dm6e/Reader/ClassicModels.html

# PREPARATION

In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
from sqlalchemy import *
from sqlalchemy.dialects.mysql import *
from sqlalchemy.orm import *
import pandas as pd

In [3]:
engine = create_engine('mysql+pymysql://ikhsan:qwertysan@localhost:3306/classicmodels')

In [4]:
conn = engine.connect()

In [5]:
def show_dataframe(stmt):
  list_result = []
  result = conn.execute(stmt)
  for row in result:
    list_result.append(dict(row))
  df = pd.DataFrame(data=list_result)
  return df

In [6]:
def sso(stmt):
  result = conn.execute(stmt).scalar()
  return result

In [7]:
def show_df_orm(query):
  df = pd.read_sql(query.statement, query.session.bind)
  return df

# SQL ALCHEMY CORE

## Persiapan Model

In [8]:
metadata = MetaData()

t_offices = Table(
    'offices', metadata,
    Column('officeCode', String(10), primary_key=True),
    Column('city', String(50), nullable=False),
    Column('phone', String(50), nullable=False),
    Column('addressLine1', String(50), nullable=False),
    Column('addressLine2', String(50)),
    Column('state', String(50)),
    Column('country', String(50), nullable=False),
    Column('postalCode', String(15), nullable=False),
    Column('territory', String(10), nullable=False)
)


t_productlines = Table(
    'productlines', metadata,
    Column('productLine', String(50), primary_key=True),
    Column('textDescription', String(4000)),
    Column('htmlDescription', MEDIUMTEXT),
    Column('image', MEDIUMBLOB)
)


t_employees = Table(
    'employees', metadata,
    Column('employeeNumber', INTEGER(11), primary_key=True),
    Column('lastName', String(50), nullable=False),
    Column('firstName', String(50), nullable=False),
    Column('extension', String(10), nullable=False),
    Column('email', String(100), nullable=False),
    Column('officeCode', ForeignKey('offices.officeCode'), nullable=False, index=True),
    Column('reportsTo', ForeignKey('employees.employeeNumber'), index=True),
    Column('jobTitle', String(50), nullable=False)
)


t_products = Table(
    'products', metadata,
    Column('productCode', String(15), primary_key=True),
    Column('productName', String(70), nullable=False),
    Column('productLine', ForeignKey('productlines.productLine'), nullable=False, index=True),
    Column('productScale', String(10), nullable=False),
    Column('productVendor', String(50), nullable=False),
    Column('productDescription', Text, nullable=False),
    Column('quantityInStock', SMALLINT(6), nullable=False),
    Column('buyPrice', DECIMAL(10, 2), nullable=False),
    Column('MSRP', DECIMAL(10, 2), nullable=False)
)


t_customers = Table(
    'customers', metadata,
    Column('customerNumber', INTEGER(11), primary_key=True),
    Column('customerName', String(50), nullable=False),
    Column('contactLastName', String(50), nullable=False),
    Column('contactFirstName', String(50), nullable=False),
    Column('phone', String(50), nullable=False),
    Column('addressLine1', String(50), nullable=False),
    Column('addressLine2', String(50)),
    Column('city', String(50), nullable=False),
    Column('state', String(50)),
    Column('postalCode', String(15)),
    Column('country', String(50), nullable=False),
    Column('salesRepEmployeeNumber', ForeignKey('employees.employeeNumber'), index=True),
    Column('creditLimit', DECIMAL(10, 2))
)


t_orders = Table(
    'orders', metadata,
    Column('orderNumber', INTEGER(11), primary_key=True),
    Column('orderDate', Date, nullable=False),
    Column('requiredDate', Date, nullable=False),
    Column('shippedDate', Date),
    Column('status', String(15), nullable=False),
    Column('comments', Text),
    Column('customerNumber', ForeignKey('customers.customerNumber'), nullable=False, index=True)
)


t_payments = Table(
    'payments', metadata,
    Column('customerNumber', ForeignKey('customers.customerNumber'), primary_key=True, nullable=False),
    Column('checkNumber', String(50), primary_key=True, nullable=False),
    Column('paymentDate', Date, nullable=False),
    Column('amount', DECIMAL(10, 2), nullable=False)
)


t_orderdetails = Table(
    'orderdetails', metadata,
    Column('orderNumber', ForeignKey('orders.orderNumber'), primary_key=True, nullable=False),
    Column('productCode', ForeignKey('products.productCode'), primary_key=True, nullable=False, index=True),
    Column('quantityOrdered', INTEGER(11), nullable=False),
    Column('priceEach', DECIMAL(10, 2), nullable=False),
    Column('orderLineNumber', SMALLINT(6), nullable=False)
)

## Code

### A. Single entity

1. Prepare a list of offices sorted by country, state, city.

In [9]:
s = t_offices.select().order_by(desc(t_offices.c.country), t_offices.c.state, t_offices.c.city)

In [10]:
print(s)

SELECT offices."officeCode", offices.city, offices.phone, offices."addressLine1", offices."addressLine2", offices.state, offices.country, offices."postalCode", offices.territory
FROM offices ORDER BY offices.country DESC, offices.state, offices.city

In [11]:
show_dataframe(s)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
5,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,None,None,France,75017,EMEA
6,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC

2. How many employees are there in the company?

In [12]:
s = select([func.count(t_employees.c.employeeNumber)])

In [13]:
print(s)

SELECT count(employees."employeeNumber") AS count_1
FROM employees

In [14]:
print("Jumlah Karyawan = %d"%sso(s))

Jumlah Karyawan = 23

3. What is the total of payments received?

In [15]:
s = select([func.sum(t_payments.c.amount)])

In [16]:
print(s)

SELECT sum(payments.amount) AS sum_1
FROM payments

In [17]:
print("Total Pembayaran yang diterima = %.2f"%sso(s))

Total Pembayaran yang diterima = 8853839.23

4. List the product lines that contain 'Cars'.

In [18]:
s = select(t_productlines.c.productLine).where(t_productlines.c.productLine.like("%Cars%"))

In [19]:
print(s)

SELECT productlines."productLine"
FROM productlines
WHERE productlines."productLine" LIKE :productLine_1

In [20]:
show_dataframe(s)

    productLine
0  Classic Cars
1  Vintage Cars

5. Report total payments for October 28, 2004.

In [21]:
from datetime import date

In [22]:
s = select([func.sum(t_payments.c.amount)])\
.where(t_payments.c.paymentDate == func.date("2004-10-28"))

print(s)

SELECT sum(payments.amount) AS sum_1
FROM payments
WHERE payments."paymentDate" = date(:date_1)

In [23]:
print("Total Pembayaran untuk 28 Oktober 2004 = %.2f"%sso(s))

Total Pembayaran untuk 28 Oktober 2004 = 47411.33

6. Report those payments greater than $100,000.

In [24]:
s = select(t_payments).where(t_payments.c.amount > 100000)
print(s)

SELECT payments."customerNumber", payments."checkNumber", payments."paymentDate", payments.amount
FROM payments
WHERE payments.amount > :amount_1

In [25]:
show_dataframe(s)

   customerNumber checkNumber paymentDate     amount
0             124    AE215433  2005-03-05  101244.59
1             124    KI131716  2003-08-15  111654.40
2             141     ID10962  2004-12-31  116208.40
3             141    JE105477  2005-03-18  120166.58
4             148    KM172879  2003-12-26  105743.00

7. List the products in each product line.

In [26]:
s = select([t_products.c.productLine, func.group_concat(t_products.c.productName)]).group_by(t_products.c.productLine)
print(s)

SELECT products."productLine", group_concat(products."productName") AS group_concat_1
FROM products GROUP BY products."productLine"

In [27]:
show_dataframe(s)

        productLine                                     group_concat_1
0      Classic Cars  1952 Alpine Renault 1300,1972 Alfa Romeo GTA,1...
1       Motorcycles  1969 Harley Davidson Ultimate Chopper,1996 Mot...
2            Planes  1980s Black Hawk Helicopter,P-51-D Mustang,192...
3             Ships  1999 Yamaha Speed Boat,18th century schooner,T...
4            Trains  Collectable Wooden Train,1950's Chicago Surfac...
5  Trucks and Buses  1958 Setra Bus,1957 Chevy Pickup,1940 Ford Pic...
6      Vintage Cars  1937 Lincoln Berline,1936 Mercedes-Benz 500K S...

8. How many products in each product line?

In [28]:
s = select([t_products.c.productLine, func.count(t_products.c.productName)]).group_by(t_products.c.productLine)
print(s)

SELECT products."productLine", count(products."productName") AS count_1
FROM products GROUP BY products."productLine"

In [29]:
show_dataframe(s)

        productLine  count_1
0      Classic Cars       38
1       Motorcycles       13
2            Planes       12
3             Ships        9
4            Trains        3
5  Trucks and Buses       11
6      Vintage Cars       24

9. What is the minimum payment received?

In [30]:
s = select([func.min(t_payments.c.amount)])
print(s)

SELECT min(payments.amount) AS min_1
FROM payments

In [31]:
print("Pembayaran Minimum yang diterima = %.2f"%sso(s))

Pembayaran Minimum yang diterima = 615.45

10. List all payments greater than twice the average payment.

In [32]:
averagePayments = select((func.avg(t_payments.c.amount)*2).label("double_avg")).alias("averagePayments")

In [33]:
s = select(t_payments).where((t_payments.c.amount) > averagePayments.c.double_avg)
print(s)

SELECT payments."customerNumber", payments."checkNumber", payments."paymentDate", payments.amount
FROM payments, (SELECT avg(payments.amount) * :avg_1 AS double_avg
FROM payments) AS "averagePayments"
WHERE payments.amount > "averagePayments".double_avg

In [34]:
show_dataframe(s)

    customerNumber checkNumber paymentDate     amount
0              114    MA765515  2004-12-15   82261.22
1              124    AE215433  2005-03-05  101244.59
2              124    BG255406  2004-08-28   85410.87
3              124     ET64396  2005-04-16   83598.04
4              124    KI131716  2003-08-15  111654.40
5              141     ID10962  2004-12-31  116208.40
6              141    IN446258  2005-03-25   65071.26
7              141    JE105477  2005-03-18  120166.58
8              148    KM172879  2003-12-26  105743.00
9              167    GN228846  2003-12-03   85024.46
10             239    NQ865547  2004-03-15   80375.24
11             321     DJ15149  2003-11-03   85559.12
12             323    AL493079  2005-05-23   75020.13

11. What is the average percentage markup of the MSRP on buyPrice?

In [35]:
s = select([func.avg((t_products.c.MSRP-t_products.c.buyPrice)/t_products.c.MSRP)*100])
print(s)

SELECT avg((products."MSRP" - products."buyPrice") / products."MSRP") * :avg_1 AS anon_1
FROM products

In [36]:
print("Persentase Markup Rata-rata MSRP pada buyPrice = %.2f%%"%sso(s))

Persentase Markup Rata-rata MSRP pada buyPrice = 45.76%

12. How many distinct products does ClassicModels sell?

In [37]:
s = select([func.count(distinct(t_products.c.productCode))])
print(s)

SELECT count(DISTINCT products."productCode") AS count_1
FROM products

In [38]:
print("Jumlah product = %d"%sso(s))

Jumlah product = 110

13. Report the name and city of customers who don't have sales representatives?

In [39]:
s = select(t_customers.c.customerName, t_customers.c.city).where(t_customers.c.salesRepEmployeeNumber == None)
print(s)

SELECT customers."customerName", customers.city
FROM customers
WHERE customers."salesRepEmployeeNumber" IS NULL

In [40]:
show_dataframe(s)

                      customerName              city
0               Havel & Zbyszek Co          Warszawa
1                Porto Imports Co.            Lisboa
2       Asian Shopping Network, Co         Singapore
3                  Natürlich Autos         Cunewalde
4                    ANG Resellers            Madrid
5         Messner Shopping Network         Frankfurt
6                Franken Gifts, Co           München
7                BG&E Collectables          Fribourg
8                 Schuyler Imports         Amsterdam
9                 Der Hund Imports            Berlin
10       Cramer Spezialitäten, Ltd       Brandenburg
11           Asian Treasures, Inc.              Cork
12            SAR Distributors, Co          Hatfield
13                 Kommission Auto           Münster
14          Lisboa Souveniers, Inc            Lisboa
15  Stuttgart Collectable Exchange         Stuttgart
16        Feuer Online Stores, Inc           Leipzig
17                Warburg Exchange            Aachen
18             Anton Designs, Ltd.            Madrid
19             Mit Vergnügen & Co.          Mannheim
20       Kremlin Collectables, Co.  Saint Petersburg
21              Raanan Stores, Inc           Herzlia

14. What are the names of executives with VP or Manager in their title? Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [41]:
s = select([func.concat(t_employees.c.firstName," ", t_employees.c.lastName).label("Full Name"), t_employees.c.jobTitle])\
    .where(t_employees.c.jobTitle.like("%VP%") | t_employees.c.jobTitle.like("%Manager%"))

In [42]:
show_dataframe(s)

           Full Name              jobTitle
0     Mary Patterson              VP Sales
1      Jeff Firrelli          VP Marketing
2  William Patterson  Sales Manager (APAC)
3      Gerard Bondur   Sale Manager (EMEA)
4        Anthony Bow    Sales Manager (NA)

15. Which orders have a value greater than $5,000?

In [43]:
s = select(t_orderdetails.c.orderNumber, t_orderdetails.c.productCode, (t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach).label("Value"))\
    .where((t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach)>5000)

In [44]:
show_dataframe(s)

     orderNumber productCode     Value
0          10103    S10_1949   5571.80
1          10103    S10_4962   5026.14
2          10105    S10_4757   6392.00
3          10105    S12_1108   8434.52
4          10105    S24_2011   5072.71
..           ...         ...       ...
405        10421    S18_2795   5847.10
406        10424    S10_1949  10072.00
407        10424    S12_1666   5960.36
408        10424    S18_1097   5859.00
409        10425    S24_2300   6261.71

[410 rows x 3 columns]

### B. One to many relationship

1. Report the account representative for each customer.

In [45]:
s = select([t_customers.c.customerName,func.concat(t_employees.c.firstName," ", t_employees.c.lastName).label("account employee"), t_employees.c.email])\
    .join(t_employees)

In [46]:
show_dataframe(s)

,customerName,account employee,email
0,Mini Gifts Distributors Ltd.,Leslie Jennings,ljennings@classicmodelcars.com
1,Mini Wheels Co.,Leslie Jennings,ljennings@classicmodelcars.com
2,Technics Stores Inc.,Leslie Jennings,ljennings@classicmodelcars.com
3,Corporate Gift Ideas Co.,Leslie Jennings,ljennings@classicmodelcars.com
4,The Sharp Gifts Warehouse,Leslie Jennings,ljennings@classicmodelcars.com
...,...,...,...
95,"Vida Sport, Ltd",Martin Gerard,mgerard@classicmodelcars.com
96,CAF Imports,Martin Gerard,mgerard@classicmodelcars.com
97,Precious Collectables,Martin Gerard,mgerard@classicmodelcars.com
98,"Corrida Auto Replicas, Ltd",Martin Gerard,mgerard@classicmodelcars.com
99,"Iberia Gift Imports, Corp.",Martin Gerard,mgerard@classicmodelcars.com

2. Report total payments for Atelier graphique.

In [47]:
s = select([func.sum(t_payments.c.amount)]).join(t_customers).where(t_customers.c.customerName == "Atelier graphique")
  
print(s)

SELECT sum(payments.amount) AS sum_1
FROM payments JOIN customers ON customers."customerNumber" = payments."customerNumber"
WHERE customers."customerName" = :customerName_1

In [48]:
print("Total pembayaran Atelier graphique = %.2f"%sso(s))

Total pembayaran Atelier graphique = 22314.36

3. Report the total payments by date

In [49]:
s = select([func.count(t_payments.c.amount).label("count payment"),func.sum(t_payments.c.amount).label("total payment"), t_payments.c.paymentDate]).order_by(t_payments.c.paymentDate)\
    .group_by(t_payments.c.paymentDate)

print(s)

SELECT count(payments.amount) AS "count payment", sum(payments.amount) AS "total payment", payments."paymentDate"
FROM payments GROUP BY payments."paymentDate" ORDER BY payments."paymentDate"

In [50]:
show_dataframe(s)

     count payment total payment paymentDate
0                1      10223.83  2003-01-16
1                1      10549.01  2003-01-28
2                1       5494.78  2003-01-30
3                1      50218.95  2003-02-16
4                1      53959.21  2003-02-20
..             ...           ...         ...
227              1      29070.38  2005-05-20
228              1      75020.13  2005-05-23
229              1      30253.75  2005-05-25
230              1      12432.32  2005-06-03
231              1      46656.94  2005-06-09

[232 rows x 3 columns]

4. Report the products that have not been sold.

In [51]:
s = select(t_products, func.sum(t_orderdetails.c.quantityOrdered))\
    .join(t_orderdetails, isouter=True)\
    .group_by(t_products.c.productCode)\
    .where(t_orderdetails.c.quantityOrdered == None)

print(s)

SELECT products."productCode", products."productName", products."productLine", products."productScale", products."productVendor", products."productDescription", products."quantityInStock", products."buyPrice", products."MSRP", sum(orderdetails."quantityOrdered") AS sum_1
FROM products LEFT OUTER JOIN orderdetails ON products."productCode" = orderdetails."productCode"
WHERE orderdetails."quantityOrdered" IS NULL GROUP BY products."productCode"

In [52]:
show_dataframe(s)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP,sum_1
0,S18_3233,1985 Toyota Supra,Classic Cars,1:18,Highway 66 Mini Classics,"This model features soft rubber tires, working...",7733,57.01,107.57,None

5. List the amount paid by each customer.

In [53]:
s = select(t_customers.c.customerName, func.sum(t_payments.c.amount))\
    .join(t_payments)\
    .group_by(t_customers.c.customerNumber)

print(s)

SELECT customers."customerName", sum(payments.amount) AS sum_1
FROM customers JOIN payments ON customers."customerNumber" = payments."customerNumber" GROUP BY customers."customerNumber"

In [54]:
show_dataframe(s)

                      customerName      sum_1
0                Atelier graphique   22314.36
1               Signal Gift Stores   80180.98
2       Australian Collectors, Co.  180585.07
3                La Rochelle Gifts  116949.68
4               Baane Mini Imports  104224.79
..                             ...        ...
93    Motor Mint Distributors Inc.   77726.59
94        Signal Collectibles Ltd.   42570.37
95  Double Decker Gift Stores, Ltd   29586.15
96            Diecast Collectables   65541.74
97               Kelly's Gift Shop  114497.19

[98 rows x 2 columns]

6. How many orders have been placed by Herkku Gifts?

In [55]:
s = select(func.count(t_customers.c.customerName))\
    .join(t_orders, t_customers.c.customerNumber == t_orders.c.customerNumber)\
    .where(t_customers.c.customerName == "Herkku Gifts")

print(s)

SELECT count(customers."customerName") AS count_1
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber"
WHERE customers."customerName" = :customerName_1

In [56]:
print("Total orderd Herkku Gifts = %d"%sso(s))

Total orderd Herkku Gifts = 3

7. Who are the employees in Boston?

In [57]:
s = select(func.concat(t_employees.c.firstName," ",t_employees.c.lastName).label("Full Name"), t_employees.c.email)\
    .join(t_offices).where(t_offices.c.city == "Boston")

print(s)

SELECT concat(employees."firstName", :concat_1, employees."lastName") AS "Full Name", employees.email
FROM employees JOIN offices ON offices."officeCode" = employees."officeCode"
WHERE offices.city = :city_1

In [58]:
show_dataframe(s)

         Full Name                            email
0   Julie Firrelli   jfirrelli@classicmodelcars.com
1  Steve Patterson  spatterson@classicmodelcars.com

8. Report those payments greater than $100,000. Sort the report so the customer who made the highest payment appears first.

In [59]:
cu = t_customers.c
t = t_payments.c

s = select([cu.customerName, t.checkNumber, t.paymentDate, func.sum(t.amount).label('Total Payment')])\
.join(t_customers).group_by(t.customerNumber)\
.having(func.sum(t.amount) > 100000)\
.order_by(desc(func.sum(t.amount)))

print(s)

SELECT customers."customerName", payments."checkNumber", payments."paymentDate", sum(payments.amount) AS "Total Payment"
FROM payments JOIN customers ON customers."customerNumber" = payments."customerNumber" GROUP BY payments."customerNumber"
HAVING sum(payments.amount) > :sum_1 ORDER BY sum(payments.amount) DESC

In [60]:
show_dataframe(s)

                    customerName checkNumber paymentDate Total Payment
0         Euro+ Shopping Channel    AU364101  2003-07-19     715738.98
1   Mini Gifts Distributors Ltd.    AE215433  2005-03-05     584188.24
2     Australian Collectors, Co.     GG31455  2003-05-20     180585.07
3             Muscle Machine Inc    BF686658  2003-12-22     177913.95
4        Dragon Souveniers, Ltd.    BI507030  2003-04-22     156251.03
5     Down Under Souveniers, Inc    AL493079  2005-05-23     154622.08
6                 AV Stores, Co.    AM968797  2004-11-03     148410.09
7        Anna's Decorations, Ltd    EM979878  2005-02-09     137034.22
8       Corporate Gift Ideas Co.     DJ15149  2003-11-03     132340.78
9         Saveley & Henriot, Co.    FP549817  2004-03-18     130305.35
10                 Rovelli Gifts    BJ483870  2004-12-05     127529.69
11            Reims Collectables    CO351193  2005-01-10     126983.19
12             La Rochelle Gifts    DB933704  2004-11-14     116949.68
13  Online Diecast Creations Co.    HL575273  2004-11-17     116449.29
14             Kelly's Gift Shop    EU531600  2005-05-25     114497.19
15    Corrida Auto Replicas, Ltd    DD995006  2004-11-15     112440.09
16               Vida Sport, Ltd    AJ574927  2004-03-13     108777.92
17             Land of Toys Inc.    CL442705  2003-03-12     107639.94
18      Danish Wholesale Imports    CN328545  2004-07-03     107446.50
19       Tokyo Collectables, Ltd    AJ478695  2005-02-14     105548.73
20              Handji Gifts& Co    BQ327613  2004-09-16     105420.57
21          Technics Stores Inc.    BR352384  2004-11-14     104545.22
22            Baane Mini Imports    DB889831  2003-02-16     104224.79
23           Suominen Souveniers    CS435306  2005-01-27     103896.74
24           Mini Creations Ltd.    GJ597719  2005-01-18     101872.52

9. List the value of 'On Hold' orders.

In [61]:
s = select(t_orders.c.orderNumber, (t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach), t_orders.c.status)\
    .join(t_orderdetails).where(t_orders.c.status == "On Hold")

In [62]:
show_dataframe(s)

    orderNumber    anon_1   status
0         10334   3380.26  On Hold
1         10334   4968.00  On Hold
2         10334   1797.58  On Hold
3         10334   2946.60  On Hold
4         10334   4983.79  On Hold
5         10334   4937.94  On Hold
6         10401   3157.98  On Hold
7         10401   3326.52  On Hold
8         10401   3799.68  On Hold
9         10401   3428.36  On Hold
10        10401   4013.59  On Hold
11        10401   3881.20  On Hold
12        10401   2321.76  On Hold
13        10401    854.04  On Hold
14        10401   8391.20  On Hold
15        10401   2018.31  On Hold
16        10401   5667.20  On Hold
17        10401   2665.20  On Hold
18        10407   6754.32  On Hold
19        10407  10723.60  On Hold
20        10407   2441.04  On Hold
21        10407   5412.00  On Hold
22        10407    546.66  On Hold
23        10407   4233.24  On Hold
24        10407   1777.10  On Hold
25        10407   2929.92  On Hold
26        10407   6215.28  On Hold
27        10407   5820.35  On Hold
28        10407   1001.65  On Hold
29        10407   4374.39  On Hold
30        10414   5597.76  On Hold
31        10414   3406.48  On Hold
32        10414   5263.99  On Hold
33        10414   4114.08  On Hold
34        10414   4669.28  On Hold
35        10414   4650.02  On Hold
36        10414   4354.80  On Hold
37        10414   3720.96  On Hold
38        10414   2294.00  On Hold
39        10414   2532.32  On Hold
40        10414   1904.64  On Hold
41        10414   2355.92  On Hold
42        10414   3376.40  On Hold
43        10414   2566.20  On Hold

10. Report the number of orders 'On Hold' for each customer.

In [63]:
s = select([t_orders.c.customerNumber, t_orders.c.status, func.count(t_orders.c.orderNumber).label('Order Amount')])\
    .join(t_orderdetails, t_orders.c.orderNumber == t_orderdetails.c.orderNumber)\
    .where(t_orders.c.status == "On Hold")\
    .group_by(t_orders.c.customerNumber)

print(s)

SELECT orders."customerNumber", orders.status, count(orders."orderNumber") AS "Order Amount"
FROM orders JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber"
WHERE orders.status = :status_1 GROUP BY orders."customerNumber"

In [64]:
show_dataframe(s)

   customerNumber   status  Order Amount
0             144  On Hold             6
1             328  On Hold            12
2             450  On Hold            12
3             362  On Hold            14

### C. Many to many relationship

1. List products sold by order date.

In [65]:
join_table = t_orders.join(t_orderdetails).join(t_products)

In [66]:
s = select([t_orders.c.orderDate, func.group_concat(t_products.c.productName).label("List Of Product Sold")])\
    .select_from(join_table).group_by(t_orders.c.orderDate)

print(s)

SELECT orders."orderDate", group_concat(products."productName") AS "List Of Product Sold"
FROM orders JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" JOIN products ON products."productCode" = orderdetails."productCode" GROUP BY orders."orderDate"

In [67]:
show_dataframe(s)

      orderDate                               List Of Product Sold
0    2003-01-06  1917 Grand Touring Sedan,1911 Ford Town Car,19...
1    2003-01-09  1932 Model A Ford J-Coupe,1928 Mercedes-Benz S...
2    2003-01-10  1937 Lincoln Berline,1936 Mercedes-Benz 500K S...
3    2003-01-29  1952 Alpine Renault 1300,1962 LanciaA Delta 16...
4    2003-01-31  1969 Corvair Monza,1957 Chevy Pickup,1998 Chry...
..          ...                                                ...
260  2005-05-16  1969 Dodge Super Bee,1976 Ford Gran Torino,195...
261  2005-05-17  1968 Ford Mustang,1968 Dodge Charger,1970 Plym...
262  2005-05-29  1917 Grand Touring Sedan,1911 Ford Town Car,19...
263  2005-05-30  1937 Lincoln Berline,1936 Mercedes-Benz 500K S...
264  2005-05-31  1952 Alpine Renault 1300,1962 LanciaA Delta 16...

[265 rows x 2 columns]

2. List the order dates in descending order for orders for the 1940 Ford Pickup Truck.

In [68]:
join_table = t_orders.join(t_orderdetails).join(t_products)

In [69]:
s = select([t_orders, t_products.c.productName])\
    .select_from(join_table)\
    .where(t_products.c.productName == "1940 Ford Pickup Truck")\
    .order_by(desc(t_orders.c.orderDate))

print(s)

SELECT orders."orderNumber", orders."orderDate", orders."requiredDate", orders."shippedDate", orders.status, orders.comments, orders."customerNumber", products."productName"
FROM orders JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" JOIN products ON products."productCode" = orderdetails."productCode"
WHERE products."productName" = :productName_1 ORDER BY orders."orderDate" DESC

In [70]:
show_dataframe(s)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productName
0,10424,2005-05-31,2005-06-08,None,In Process,None,141,1940 Ford Pickup Truck
1,10411,2005-05-01,2005-05-08,2005-05-06,Shipped,None,233,1940 Ford Pickup Truck
2,10391,2005-03-09,2005-03-20,2005-03-15,Shipped,None,276,1940 Ford Pickup Truck
3,10381,2005-02-17,2005-02-25,2005-02-18,Shipped,None,321,1940 Ford Pickup Truck
4,10370,2005-01-20,2005-02-01,2005-01-25,Shipped,None,276,1940 Ford Pickup Truck
5,10357,2004-12-10,2004-12-16,2004-12-14,Shipped,None,124,1940 Ford Pickup Truck
6,10347,2004-11-29,2004-12-07,2004-11-30,Shipped,Can we deliver the new Ford Mustang models by ...,114,1940 Ford Pickup Truck
7,10333,2004-11-18,2004-11-27,2004-11-20,Shipped,None,129,1940 Ford Pickup Truck
8,10322,2004-11-04,2004-11-12,2004-11-10,Shipped,Customer has worked with some of our vendors i...,363,1940 Ford Pickup Truck
9,10312,2004-10-21,2004-10-27,2004-10-23,Shipped,None,124,1940 Ford Pickup Truck
10,10304,2004-10-11,2004-10-20,2004-10-17,Shipped,None,256,1940 Ford Pickup Truck
11,10291,2004-09-08,2004-09-17,2004-09-14,Shipped,None,448,1940 Ford Pickup Truck
12,10280,2004-08-17,2004-08-27,2004-08-19,Shipped,None,249,1940 Ford Pickup Truck
13,10270,2004-07-19,2004-07-27,2004-07-24,Shipped,Can we renegotiate this one?,282,1940 Ford Pickup Truck
14,10258,2004-06-15,2004-06-25,2004-06-23,Shipped,None,398,1940 Ford Pickup Truck
15,10245,2004-05-04,2004-05-12,2004-05-09,Shipped,None,455,1940 Ford Pickup Truck
16,10228,2004-03-10,2004-03-18,2004-03-13,Shipped,None,173,1940 Ford Pickup Truck
17,10215,2004-01-29,2004-02-08,2004-02-01,Shipped,Customer requested that FedEx Ground is used f...,475,1940 Ford Pickup Truck
18,10206,2003-12-05,2003-12-13,2003-12-08,Shipped,Can we renegotiate this one?,202,1940 Ford Pickup Truck
19,10194,2003-11-25,2003-12-02,2003-11-26,Shipped,None,146,1940 Ford Pickup Truck
20,10183,2003-11-13,2003-11-22,2003-11-15,Shipped,We need to keep in close contact with their Ma...,339,1940 Ford Pickup Truck
21,10174,2003-11-06,2003-11-15,2003-11-10,Shipped,None,333,1940 Ford Pickup Truck
22,10164,2003-10-21,2003-10-30,2003-10-23,Resolved,"This order was disputed, but resolved on 11/1/...",452,1940 Ford Pickup Truck
23,10150,2003-09-19,2003-09-27,2003-09-21,Shipped,They want to reevaluate their terms agreement ...,148,1940 Ford Pickup Truck
24,10140,2003-07-24,2003-08-02,2003-07-30,Shipped,None,161,1940 Ford Pickup Truck
25,10126,2003-05-28,2003-06-07,2003-06-02,Shipped,None,458,1940 Ford Pickup Truck
26,10113,2003-03-26,2003-04-02,2003-03-27,Shipped,None,124,1940 Ford Pickup Truck
27,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121,1940 Ford Pickup Truck

3. List the names of customers and their corresponding order number where a particular order from that customer has a value greater than $25,000?

In [71]:
join_table = t_customers.join(t_orders).join(t_orderdetails)

In [72]:
s = select(t_customers.c.customerName, t_orders.c.orderNumber, func.sum(t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach)).select_from(join_table).group_by(t_customers.c.customerName)\
    .having(func.sum(t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach)>25000)

print(s)

SELECT customers."customerName", orders."orderNumber", sum(orderdetails."quantityOrdered" * orderdetails."priceEach") AS sum_1
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" GROUP BY customers."customerName"
HAVING sum(orderdetails."quantityOrdered" * orderdetails."priceEach") > :sum_2

In [73]:
show_dataframe(s)

                      customerName  orderNumber      sum_1
0               Signal Gift Stores        10124   80180.98
1       Australian Collectors, Co.        10120  180585.07
2                La Rochelle Gifts        10275  158573.12
3               Baane Mini Imports        10103  104224.79
4     Mini Gifts Distributors Ltd.        10113  591827.34
..                             ...          ...        ...
90    Motor Mint Distributors Inc.        10109   77726.59
91        Signal Collectibles Ltd.        10149   42570.37
92  Double Decker Gift Stores, Ltd        10186   29586.15
93            Diecast Collectables        10207   65541.74
94               Kelly's Gift Shop        10138  137460.79

[95 rows x 3 columns]

4. Are there any products that appear on all orders?

In [74]:
p = t_products.c
o = t_orderdetails.c

In [75]:
totaltrans = select([func.count(o.orderNumber).label("total")]).alias("t")

In [76]:
apperCount = select(o.productCode, p.productName, func.count(o.orderNumber).label("totalAppear")).join(t_products).group_by(o.productCode).alias("appearCount")

In [77]:
s = select(apperCount).where(apperCount.c.totalAppear == totaltrans.c.total)

In [78]:
show_dataframe(s)

Empty DataFrame
Columns: []
Index: []

5. List the names of products sold at less than 80% of the MSRP.

In [79]:
s = select(t_products.c.productName, t_orderdetails.c.priceEach, (t_products.c.MSRP * 0.8).label("80% of MSRP"))\
    .join(t_orderdetails)\
    .where(t_orderdetails.c.priceEach < (t_products.c.MSRP * 0.8))

print(s)

SELECT products."productName", orderdetails."priceEach", products."MSRP" * :MSRP_1 AS "80% of MSRP"
FROM products JOIN orderdetails ON products."productCode" = orderdetails."productCode"
WHERE orderdetails."priceEach" < products."MSRP" * :MSRP_2

In [80]:
show_dataframe(s)

                  productName priceEach  80% of MSRP
0    1952 Alpine Renault 1300    171.44      171.440
1       1996 Moto Guzzi 1100i     95.15       95.152
2         1972 Alfa Romeo GTA    108.80      108.800
3           1957 Chevy Pickup     94.80       94.800
4           1957 Chevy Pickup     94.80       94.800
..                        ...       ...          ...
56            1982 Camaro Z28     80.92       80.920
57              ATA: B757-300     94.92       94.920
58  American Airlines: MD-11S     59.22       59.224
59                 Pont Yacht     43.68       43.680
60                 Pont Yacht     43.68       43.680

[61 rows x 3 columns]

6. Reports those products that have been sold with a markup of 100% or more (i.e.,  the priceEach is at least twice the buyPrice)

In [81]:
s = select(t_products.c.productName, (2*t_products.c.buyPrice), t_orderdetails.c.priceEach)\
    .join(t_orderdetails).where(t_orderdetails.c.priceEach >= (2*t_products.c.buyPrice))

print(s)

SELECT products."productName", :buyPrice_1 * products."buyPrice" AS anon_1, orderdetails."priceEach"
FROM products JOIN orderdetails ON products."productCode" = orderdetails."productCode"
WHERE orderdetails."priceEach" >= :buyPrice_2 * products."buyPrice"

In [82]:
show_dataframe(s)

                   productName  anon_1 priceEach
0     1952 Alpine Renault 1300  197.16    214.30
1     1952 Alpine Renault 1300  197.16    197.16
2     1952 Alpine Renault 1300  197.16    205.73
3     1952 Alpine Renault 1300  197.16    212.16
4     1952 Alpine Renault 1300  197.16    207.87
..                         ...     ...       ...
495            1982 Camaro Z28   93.06     94.07
496            1982 Camaro Z28   93.06    100.14
497            1982 Camaro Z28   93.06    101.15
498  American Airlines: MD-11S   72.54     74.03
499  American Airlines: MD-11S   72.54     73.29

[500 rows x 3 columns]

7. List the products ordered on a Monday.

In [83]:
join_table = t_products.join(t_orderdetails).join(t_orders)

In [84]:
s = select(t_products.c.productName, t_orders.c.orderDate, func.dayname(t_orders.c.orderDate).label("Day name"))\
    .select_from(join_table).where(func.dayname(t_orders.c.orderDate)=="Monday")

In [85]:
show_dataframe(s)

                               productName   orderDate Day name
0    1969 Harley Davidson Ultimate Chopper  2003-02-24   Monday
1    1969 Harley Davidson Ultimate Chopper  2003-08-25   Monday
2    1969 Harley Davidson Ultimate Chopper  2003-12-01   Monday
3    1969 Harley Davidson Ultimate Chopper  2004-04-05   Monday
4    1969 Harley Davidson Ultimate Chopper  2004-06-28   Monday
..                                     ...         ...      ...
402                       Boeing X-32A JSF  2004-11-15   Monday
403                       Boeing X-32A JSF  2005-01-31   Monday
404                       Boeing X-32A JSF  2005-05-09   Monday
405                             Pont Yacht  2005-01-31   Monday
406                             Pont Yacht  2005-03-28   Monday

[407 rows x 3 columns]

8. What is the quantity on hand for products listed on 'On Hold' orders?

In [86]:
join_table = t_products.join(t_orderdetails).join(t_orders)

In [87]:
s = select(t_products.c.productName, t_products.c.quantityInStock)\
    .select_from(join_table).where(t_orders.c.status=="On Hold")

print(s)

SELECT products."productName", products."quantityInStock"
FROM products JOIN orderdetails ON products."productCode" = orderdetails."productCode" JOIN orders ON orders."orderNumber" = orderdetails."orderNumber"
WHERE orders.status = :status_1

In [88]:
show_dataframe(s)

                            productName  quantityInStock
0                1962 LanciaA Delta 16V             6791
1                1964 Mercedes Tour Bus             8258
2                 1926 Ford Fire Engine             2018
3           1992 Ferrari 360 Spider red             8347
4                      1940s Ford truck             3128
5              1962 Volkswagen Microbus             2327
6                        P-51-D Mustang              992
7      1928 British Royal Navy Airplane             3627
8              Corsair F4U ( Bird Cage)             6812
9               1900s Vintage Tri-Plane             2756
10                     1997 BMW F650 ST              178
11             1928 Ford Phaeton Deluxe              136
12         1930 Buick Marquette Phaeton             7062
13          American Airlines: B767-300             5841
14       America West Airlines B757-200             9653
15                        ATA: B757-300             7106
16                   F/A 18 Hornet 1/72              551
17            American Airlines: MD-11S             8820
18                1965 Aston Martin DB5             9042
19             1917 Grand Touring Sedan             2724
20                   1911 Ford Town Car              540
21         1999 Indy 500 Monte Carlo SS             8164
22  1932 Alfa Romeo 8C2300 Spider Sport             6553
23                1957 Ford Thunderbird             3209
24           1970 Chevy Chevelle SS 454             1005
25            1966 Shelby Cobra 427 S/C             8197
26                   1949 Jaguar XK 120             2350
27                    1952 Citroen-15CV             1452
28            1969 Chevrolet Camaro Z28             4695
29                  2002 Chevy Corvette             9446
30                  1972 Alfa Romeo GTA             3252
31               1999 Yamaha Speed Boat             4259
32                    1903 Ford Model A             3913
33             Collectable Wooden Train             6450
34                  1904 Buick Runabout             8290
35                18th century schooner             1898
36     1912 Ford Model T Delivery Wagon             9173
37             1940 Ford Delivery Sedan             6621
38                The Schooner Bluenose             1897
39                        The Mayflower              737
40            The USS Constitution Ship             7083
41                          The Titanic             1956
42                       The Queen Mary             5088
43                           Pont Yacht              414

### D. Regular expressions

1. Find products containing the name 'Ford'.

In [89]:
s = select([t_products.c.productCode, t_products.c.productName])\
    .where(t_products.c.productName.regexp_match('Ford'))

print(s)

SELECT products."productCode", products."productName"
FROM products
WHERE products."productName" <regexp> :productName_1

In [90]:
show_dataframe(s)

   productCode                       productName
0     S12_1099                 1968 Ford Mustang
1     S12_3891                  1969 Ford Falcon
2     S18_1097            1940 Ford Pickup Truck
3     S18_2248                1911 Ford Town Car
4     S18_2325         1932 Model A Ford J-Coupe
5     S18_2432             1926 Ford Fire Engine
6     S18_2949       1913 Ford Model T Speedster
7     S18_2957                1934 Ford V8 Coupe
8     S18_3140                 1903 Ford Model A
9     S18_3482             1976 Ford Gran Torino
10    S18_4600                  1940s Ford truck
11    S18_4933             1957 Ford Thunderbird
12    S24_3151  1912 Ford Model T Delivery Wagon
13    S24_3816          1940 Ford Delivery Sedan
14    S32_4289          1928 Ford Phaeton Deluxe

2. List products ending in 'ship'.

In [91]:
s = select([t_products.c.productCode, t_products.c.productName])\
    .where(t_products.c.productName.regexp_match('ship$'))

print(s)

SELECT products."productCode", products."productName"
FROM products
WHERE products."productName" <regexp> :productName_1

In [92]:
show_dataframe(s)

  productCode                productName
0   S700_2610  The USS Constitution Ship

3. Report the number of customers in Denmark, Norway, and Sweden.

In [93]:
s = select([t_customers.c.country, func.count(t_customers.c.customerNumber).label("Number Customer")])\
    .where(t_customers.c.country.in_(['Denmark','Norway','Sweden']))\
    .group_by(t_customers.c.country)

print(s)

SELECT customers.country, count(customers."customerNumber") AS "Number Customer"
FROM customers
WHERE customers.country IN ([POSTCOMPILE_country_1]) GROUP BY customers.country

In [94]:
show_dataframe(s)

   country  Number Customer
0   Norway                3
1   Sweden                2
2  Denmark                2

4. What are the products with a product code in the range S700_1000 to S700_1499?

In [95]:
s = select([t_products.c.productCode, t_products.c.productName])\
    .where(between(t_products.c.productCode,'S700_1000','S700_1499'))

print(s)

SELECT products."productCode", products."productName"
FROM products
WHERE products."productCode" BETWEEN :productCode_1 AND :productCode_2

In [96]:
show_dataframe(s)

  productCode            productName
0   S700_1138  The Schooner Bluenose

5. Which customers have a digit in their name?

In [97]:
s = select([t_customers.c.customerNumber,t_customers.c.customerName])\
    .where(t_customers.c.customerName.regexp_match('[0-9]+'))

print(s)

SELECT customers."customerNumber", customers."customerName"
FROM customers
WHERE customers."customerName" <regexp> :customerName_1

In [98]:
show_dataframe(s)

   customerNumber       customerName
0             205  Toys4GrownUps.com
1             362  Gifts4AllAges.com

6. List the names of employees called Dianne or Diane.

In [99]:
s = select([t_employees.c.employeeNumber, func.concat(t_employees.c.firstName," ", t_employees.c.lastName).label("full name")])\
    .where(or_(t_employees.c.lastName.regexp_match("Dian{1,2}e"),\
               t_employees.c.firstName.regexp_match("Dian{1,2}e"),))
    
print(s)

SELECT employees."employeeNumber", concat(employees."firstName", :concat_1, employees."lastName") AS "full name"
FROM employees
WHERE employees."lastName" <regexp> :lastName_1 OR employees."firstName" <regexp> :firstName_1

In [100]:
show_dataframe(s)

   employeeNumber     full name
0            1002  Diane Murphy

7. List the products containing ship or boat in their product name.

In [101]:
s = select([t_products.c.productCode, t_products.c.productName])\
    .where(t_products.c.productName.regexp_match("([Bb]oat|[Ss]hip)"))

print(s)

SELECT products."productCode", products."productName"
FROM products
WHERE products."productName" <regexp> :productName_1

In [102]:
show_dataframe(s)

  productCode                productName
0    S18_3029     1999 Yamaha Speed Boat
1   S700_2610  The USS Constitution Ship

8. List the products with a product code beginning with S700.

In [103]:
s = select([t_products.c.productCode, t_products.c.productName])\
    .where(t_products.c.productCode.regexp_match('^(S700).+'))

print(s)

SELECT products."productCode", products."productName"
FROM products
WHERE products."productCode" <regexp> :productCode_1

In [104]:
show_dataframe(s)

   productCode                     productName
0    S700_1138           The Schooner Bluenose
1    S700_1691     American Airlines: B767-300
2    S700_1938                   The Mayflower
3    S700_2047                      HMS Bounty
4    S700_2466  America West Airlines B757-200
5    S700_2610       The USS Constitution Ship
6    S700_2824                 1982 Camaro Z28
7    S700_2834                   ATA: B757-300
8    S700_3167              F/A 18 Hornet 1/72
9    S700_3505                     The Titanic
10   S700_3962                  The Queen Mary
11   S700_4002       American Airlines: MD-11S

9. List the names of employees called Larry or Barry.

In [105]:
s = select([t_employees.c.employeeNumber, func.concat(t_employees.c.firstName," ", t_employees.c.lastName).label("full name")])\
    .where(or_(t_employees.c.lastName.regexp_match("[LB]arry"),t_employees.c.firstName.regexp_match("[LB]arry")))

In [106]:
show_dataframe(s)

   employeeNumber    full name
0            1501   Larry Bott
1            1504  Barry Jones

10. List the names of employees with non-alphabetic characters in their names.

In [107]:
s = select([t_employees.c.employeeNumber, func.concat(t_employees.c.firstName," ", t_employees.c.lastName).label("full name")])\
    .where(or_(t_employees.c.lastName.regexp_match('[^A-Za-z]'),\
               t_employees.c.firstName.regexp_match('[^A-Za-z]')))
    
print(s)

SELECT employees."employeeNumber", concat(employees."firstName", :concat_1, employees."lastName") AS "full name"
FROM employees
WHERE employees."lastName" <regexp> :lastName_1 OR employees."firstName" <regexp> :firstName_1

In [108]:
show_dataframe(s)

   employeeNumber       full name
0            1286  Foon Yue Tseng

11. List the vendors whose name ends in Diecast

In [109]:
s = select([func.distinct(t_products.c.productVendor).label("Vendor Name")])\
    .where(t_products.c.productVendor.regexp_match("Diecast$"))

print(s)

SELECT distinct(products."productVendor") AS "Vendor Name"
FROM products
WHERE products."productVendor" <regexp> :productVendor_1

In [110]:
show_dataframe(s)

           Vendor Name
0      Min Lin Diecast
1    Red Start Diecast
2  Second Gear Diecast

### E. General queries

1. Who is at the top of the organization (i.e., reports to no one).

In [111]:
s = select(t_employees).where(t_employees.c.reportsTo == None)

print(s)

SELECT employees."employeeNumber", employees."lastName", employees."firstName", employees.extension, employees.email, employees."officeCode", employees."reportsTo", employees."jobTitle"
FROM employees
WHERE employees."reportsTo" IS NULL

In [112]:
show_dataframe(s)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President

2. Who reports to William Patterson?

In [113]:
wp = t_employees.alias('wp')

s = select([t_employees.c.employeeNumber, func.concat(t_employees.c.firstName, " ", t_employees.c.lastName).label("Name Employee"), func.concat(wp.c.firstName," ", wp.c.lastName).label("ReportTo")])\
    .join(wp, t_employees.c.reportsTo == wp.c.employeeNumber)\
    .where(and_(wp.c.firstName == "William",wp.c.lastName == "Patterson"))

print(s)

SELECT employees."employeeNumber", concat(employees."firstName", :concat_1, employees."lastName") AS "Name Employee", concat(wp."firstName", :concat_2, wp."lastName") AS "ReportTo"
FROM employees JOIN employees AS wp ON employees."reportsTo" = wp."employeeNumber"
WHERE wp."firstName" = :firstName_1 AND wp."lastName" = :lastName_1

In [114]:
show_dataframe(s)

   employeeNumber Name Employee           ReportTo
0            1611   Andy Fixter  William Patterson
1            1612   Peter Marsh  William Patterson
2            1619      Tom King  William Patterson

3. List all the products purchased by Herkku Gifts.

In [115]:
s = select([t_products.c.productName])\
    .join(t_orders, t_customers.c.customerNumber == t_orders.c.customerNumber)\
    .join(t_orderdetails, t_orders.c.orderNumber == t_orderdetails.c.orderNumber)\
    .join(t_products, t_orderdetails.c.productCode == t_products.c.productCode)\
    .where(t_customers.c.customerName == "Herkku Gifts")

print(s)

SELECT products."productName"
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" JOIN products ON orderdetails."productCode" = products."productCode"
WHERE customers."customerName" = :customerName_1

In [116]:
show_dataframe(s)

                                  productName
0                           1968 Ford Mustang
1                          1968 Dodge Charger
2                     1970 Plymouth Hemi Cuda
3                          1969 Dodge Charger
4                             1993 Mazda RX-7
5                       1965 Aston Martin DB5
6                 1948 Porsche 356-A Roadster
7                            1995 Honda Civic
8                1999 Indy 500 Monte Carlo SS
9                 1992 Ferrari 360 Spider red
10                       1969 Dodge Super Bee
11                      1976 Ford Gran Torino
12             1948 Porsche Type 356 Roadster
13                  1966 Shelby Cobra 427 S/C
14                    1982 Lamborghini Diablo
15                  1971 Alpine Renault 1600s
16                    1956 Porsche 356A Coupe
17      1969 Harley Davidson Ultimate Chopper
18                      1996 Moto Guzzi 1100i
19       2003 Harley-Davidson Eagle Drag Bike
20        1936 Harley Davidson El Knucklehead
21                          1997 BMW R 1100 S
22                   1960 BSA Gold Star DBD34
23                           1997 BMW F650 ST
24                              ATA: B757-300
25                       1937 Lincoln Berline
26   1936 Mercedes-Benz 500K Special Roadster
27                     1928 Mercedes-Benz SSK
28  1938 Cadillac V-16 Presidential Limousine

4. Compute the commission for each sales representative, assuming the commission is 5% of the value of an order. Sort by employee last name and first name.

In [117]:
commision = func.sum(t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered * 0.05).label('commision')

s = select([t_employees.c.lastName, t_employees.c.firstName, commision])\
    .join(t_customers, t_employees.c.employeeNumber == t_customers.c.salesRepEmployeeNumber)\
    .join(t_orders, t_customers.c.customerNumber == t_orders.c.customerNumber)\
    .join(t_orderdetails, t_orders.c.orderNumber == t_orderdetails.c.orderNumber)\
    .group_by(t_employees.c.employeeNumber)\
    .order_by(t_employees.c.lastName.desc(), t_employees.c.firstName.desc())

print(s)

SELECT employees."lastName", employees."firstName", sum(orderdetails."priceEach" * orderdetails."quantityOrdered" * :param_1) AS commision
FROM employees JOIN customers ON employees."employeeNumber" = customers."salesRepEmployeeNumber" JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" GROUP BY employees."employeeNumber" ORDER BY employees."lastName" DESC, employees."firstName" DESC

In [118]:
show_dataframe(s)

     lastName firstName   commision
0      Vanauf    George  33468.8525
1       Tseng  Foon Yue  24410.6335
2    Thompson    Leslie  17376.6515
3   Patterson     Steve  25293.7710
4       Nishi      Mami  22855.5035
5       Marsh     Peter  29229.6880
6       Jones     Barry  35242.6955
7    Jennings    Leslie  54076.5270
8   Hernandez    Gerard  62928.8905
9      Gerard    Martin  19373.8735
10     Fixter      Andy  28129.1295
11   Firrelli     Julie  19333.1600
12   Castillo    Pamela  43411.0275
13       Bott     Larry  36604.8395
14     Bondur      Loui  28474.2875

5. What is the difference in days between the most recent and oldest order date in the Orders file?

In [119]:
s = select([func.datediff(func.max(t_orders.c.orderDate), func.min(t_orders.c.orderDate))])

print("Apa perbedaan hari antara tanggal pesanan terbaru dan tertua = %d"%sso(s))

Apa perbedaan hari antara tanggal pesanan terbaru dan tertua = 876

6. Compute the average time between order date and ship date for each customer ordered by the largest difference.

In [120]:
days_delay = func.sum(func.datediff(t_orders.c.shippedDate, t_orders.c.orderDate))

s = select([t_customers.c.customerName, (days_delay/func.count(t_orders.c.orderDate)).label('Average Time(day)')])\
    .join(t_orders, t_customers.c.customerNumber == t_orders.c.customerNumber)\
    .group_by(t_customers.c.customerNumber)\
    .order_by((days_delay/func.count(t_orders.c.orderDate)).desc())

print(s)

SELECT customers."customerName", sum(datediff(orders."shippedDate", orders."orderDate")) / count(orders."orderDate") AS "Average Time(day)"
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber" GROUP BY customers."customerNumber" ORDER BY sum(datediff(orders."shippedDate", orders."orderDate")) / count(orders."orderDate") DESC

In [121]:
show_dataframe(s)

                          customerName Average Time(day)
0              Dragon Souveniers, Ltd.           14.6000
1                 Osaka Souveniers Co.            7.5000
2                          Mini Caravy            5.6667
3              Auto-Moto Classics Inc.            5.6667
4              Tokyo Collectables, Ltd            5.5000
..                                 ...               ...
93               UK Collectables, Ltd.            1.6667
94                   Gifts4AllAges.com            1.6667
95                   Land of Toys Inc.            1.5000
96  Bavarian Collectables Imports, Co.            1.0000
97                          Petit Auto            0.6667

[98 rows x 2 columns]

7. What is the value of orders shipped in August 2004? ([Hint](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html)).

In [122]:
value_each = t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered
year = extract('YEAR', t_orders.c.shippedDate)
month = extract('MONTH', t_orders.c.shippedDate)

In [123]:
s = select([func.sum(value_each)])\
    .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
    .where(and_(month == 8,year == 2004))

In [124]:
print("valut dari agustus 2004 = %d"%sso(s))

valut dari agustus 2004 = 355964

8. Compute the total value ordered, total amount paid, and their difference for each customer for orders placed in 2004 and payments received in 2004 (Hint; Create views for the total paid and total ordered).

In [125]:
orders = select([t_customers.c.customerName.label('customerName'), func.sum(t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach).label('totalOrderValue')])\
             .join(t_orders, t_customers.c.customerNumber == t_orders.c.customerNumber, isouter=True)\
             .join(t_orderdetails, t_orders.c.orderNumber == t_orderdetails.c.orderNumber)\
             .where(extract('Year', t_orders.c.orderDate) == 2004)\
             .group_by(t_customers.c.customerName).alias('orders')

In [126]:
payments = select([t_customers.c.customerName.label('customerName'), func.sum(t_payments.c.amount).label('totalPayment')])\
               .join(t_payments, t_customers.c.customerNumber == t_payments.c.customerNumber, isouter=True)\
               .where(extract('Year', t_payments.c.paymentDate) == 2004)\
               .group_by(t_customers.c.customerName).alias('payments')

In [127]:
s = select([orders.c.customerName, orders.c.totalOrderValue, payments.c.totalPayment, (orders.c.totalOrderValue-payments.c.totalPayment).label('difference')])\
                     .join(payments, orders.c.customerName == payments.c.customerName)

In [128]:
show_dataframe(s)

                      customerName totalOrderValue totalPayment difference
0                Atelier graphique         7742.92      7742.92       0.00
1               Signal Gift Stores        47539.00     47539.00       0.00
2       Australian Collectors, Co.       127155.96    127155.96       0.00
3                La Rochelle Gifts        67426.01     67426.01       0.00
4               Baane Mini Imports        52514.46     52514.46       0.00
..                             ...             ...          ...        ...
83    Motor Mint Distributors Inc.        51893.45     51893.45       0.00
84        Signal Collectibles Ltd.        12573.28     12573.28       0.00
85  Double Decker Gift Stores, Ltd         7310.42      7310.42       0.00
86            Diecast Collectables         6276.60      6276.60       0.00
87               Kelly's Gift Shop        52166.00     52166.00       0.00

[88 rows x 4 columns]

9. List the employees who report to those employees who report to Diane Murphy. Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [129]:
leader = t_employees.alias('leader')
coleader = t_employees.alias('coleader')

In [130]:
l = select([coleader.c.employeeNumber]).join(leader, coleader.c.reportsTo == leader.c.employeeNumber).where(leader.c.reportsTo == None).alias("l")

In [131]:
s = select([func.concat(t_employees.c.firstName,' ', t_employees.c.lastName).label('Fullname'), t_employees.c.reportsTo])\
    .join(coleader, t_employees.c.reportsTo == coleader.c.employeeNumber)\
    .where(t_employees.c.reportsTo.in_(l))

In [132]:
show_dataframe(s)

            Fullname  reportsTo
0  William Patterson       1056
1      Gerard Bondur       1056
2        Anthony Bow       1056
3         Mami Nishi       1056

10. What is the percentage value of each product in inventory sorted by the highest percentage first (Hint: Create a view first).

In [133]:
inventory_stock = select(func.sum(t_products.c.quantityInStock))
inventory_stock = conn.execute(inventory_stock).scalar()

In [134]:
s = select([t_products.c.productCode, t_products.c.productName, func.concat((t_products.c.quantityInStock/inventory_stock)*100,"%").label('quantityPercentage')])\
    .order_by(((t_products.c.quantityInStock/inventory_stock)*100).desc())

In [135]:
show_dataframe(s)

    productCode                     productName quantityPercentage
0      S12_2823                2002 Suzuki XREO            1.8008%
1      S18_1984                1995 Honda Civic            1.7603%
2     S700_2466  America West Airlines B757-200            1.7389%
3      S24_3432             2002 Chevy Corvette            1.7016%
4      S18_2325       1932 Model A Ford J-Coupe            1.6850%
..          ...                             ...                ...
105    S72_3212                      Pont Yacht            0.0746%
106    S32_1374                1997 BMW F650 ST            0.0321%
107    S32_4289        1928 Ford Phaeton Deluxe            0.0245%
108    S12_1099               1968 Ford Mustang            0.0122%
109    S24_2000        1960 BSA Gold Star DBD34            0.0027%

[110 rows x 3 columns]

11. Write a function to convert miles per gallon to liters per 100 kilometers.

In [136]:
def convert_mpg_lpkm(mpg):
  return 235.21 / mpg

12. Write a procedure to increase the price of a specified product category by a given percentage. You will need to create a product table with appropriate data to test your procedure. Alternatively, load the ClassicModels database on your personal machine so you have complete access. You have to change the [DELIMITER](http://dev.mysql.com/doc/refman/5.1/en/stored-programs-defining.html) prior to creating the procedure.

In [137]:
s = text("UPDATE products SET MSRP = MSRP * :x WHERE  productLine = :y")
print(s)

UPDATE products SET MSRP = MSRP * :x WHERE  productLine = :y

13. What is the value of orders shipped in August 2004? ([Hint](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html)).

In [138]:
value_each = t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered
year = extract('YEAR', t_orders.c.shippedDate)
month = extract('MONTH', t_orders.c.shippedDate)

In [139]:
s = select([func.sum(value_each)])\
    .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
    .where(and_(month == 8,year == 2004))

In [140]:
print("Value of order shipped in agustus 2004 %.2f"%sso(s))

Value of order shipped in agustus 2004 355964.29

14. What is the ratio the value of payments made to orders received for each month of 2004. (i.e., divide the value of payments made by the orders received)?

In [141]:
oc_2004 = select(func.month(t_orders.c.orderDate).label('Month'), func.count(t_orders.c.orderNumber).label('Count'))\
            .where(extract('YEAR',t_orders.c.orderDate) == 2004)\
            .group_by(func.month(t_orders.c.orderDate)).alias("oc_2004")

In [142]:
s = select([func.month(t_payments.c.paymentDate).label('mont'),func.sum(t_payments.c.amount).label('payment'),oc_2004.c.Count.label('orderReceived'), (func.sum(t_payments.c.amount)/oc_2004.c.Count).label('ratio') ])\
    .where(extract('YEAR',t_payments.c.paymentDate) == 2004)\
    .group_by(func.month(t_payments.c.paymentDate))\
    .join(oc_2004, func.month(t_payments.c.paymentDate) == oc_2004.c.Month)\
    .order_by()

print(s)

SELECT month(payments."paymentDate") AS mont, sum(payments.amount) AS payment, oc_2004."Count" AS "orderReceived", sum(payments.amount) / oc_2004."Count" AS ratio
FROM payments JOIN (SELECT month(orders."orderDate") AS "Month", count(orders."orderNumber") AS "Count"
FROM orders
WHERE EXTRACT(YEAR FROM orders."orderDate") = :param_1 GROUP BY month(orders."orderDate")) AS oc_2004 ON month(payments."paymentDate") = oc_2004."Month"
WHERE EXTRACT(YEAR FROM payments."paymentDate") = :param_2 GROUP BY month(payments."paymentDate")

In [143]:
show_dataframe(s)

    mont    payment  orderReceived         ratio
0     10  185103.43             13  14238.725385
1     12  819285.62             13  63021.970769
2      8  378094.30             12  31507.858333
3      3  404603.21              8  50575.401250
4     11  857187.30             33  25975.372727
5      9  476445.53             12  39703.794167
6      1  234152.13              8  29269.016250
7      7  284191.48             11  25835.589091
8      5  208524.42              8  26065.552500
9      4  173245.96             10  17324.596000
10     2  106652.01             11   9695.637273
11     6  185842.86             12  15486.905000

15. What is the difference in the amount received for each month of 2004 compared to 2003?

In [144]:
year_2004 = select([func.month(t_payments.c.paymentDate).label('Month'), func.sum(t_payments.c.amount).label('Amount')])\
            .where(extract('YEAR',t_payments.c.paymentDate) == 2004)\
            .group_by(func.month(t_payments.c.paymentDate))\
            .alias('year_2004')

In [145]:
s = select([func.month(t_payments.c.paymentDate).label('month'), year_2004.c.Amount.label('amountReceived2004'), func.sum(t_payments.c.amount).label('amountReceived2003'), (year_2004.c.Amount - func.sum(t_payments.c.amount)).label('difference')])\
    .where(extract('YEAR',t_payments.c.paymentDate) == 2003)\
    .group_by(func.month(t_payments.c.paymentDate))\
    .join(year_2004, func.month(t_payments.c.paymentDate) == year_2004.c.Month)

print(s)

SELECT month(payments."paymentDate") AS month, year_2004."Amount" AS "amountReceived2004", sum(payments.amount) AS "amountReceived2003", year_2004."Amount" - sum(payments.amount) AS difference
FROM payments JOIN (SELECT month(payments."paymentDate") AS "Month", sum(payments.amount) AS "Amount"
FROM payments
WHERE EXTRACT(YEAR FROM payments."paymentDate") = :param_1 GROUP BY month(payments."paymentDate")) AS year_2004 ON month(payments."paymentDate") = year_2004."Month"
WHERE EXTRACT(YEAR FROM payments."paymentDate") = :param_2 GROUP BY month(payments."paymentDate")

In [146]:
show_dataframe(s)

    month amountReceived2004 amountReceived2003  difference
0       6          185842.86          180218.98     5623.88
1       5          208524.42          159881.97    48642.45
2       2          106652.01          144384.36   -37732.35
3      10          185103.43          316857.96  -131754.53
4       4          173245.96          136313.92    36932.04
5       8          378094.30          246204.86   131889.44
6      11          857187.30          694292.68   162894.62
7       1          234152.13           26267.62   207884.51
8      12          819285.62          826637.64    -7352.02
9       3          404603.21          199704.48   204898.73
10      7          284191.48          158247.00   125944.48
11      9          476445.53          161206.23   315239.30

16. Write a procedure to report the amount ordered in a specific month and year for customers containing a specified character string in their name.

In [147]:
month = extract('MONTH', t_orders.c.orderDate)
year = extract('YEAR', t_orders.c.orderDate)

In [148]:
join_table = t_customers.join(t_orders).join(t_orderdetails)

In [149]:
s = select([t_customers.c.customerNumber, t_customers.c.customerName, func.sum(t_orderdetails.c.quantityOrdered).label('Amount Ordered')])\
    .select_from(join_table)\
    .where(and_(t_customers.c.customerName.like("%s%"),month == 8,year == 2004,))\
    .group_by(t_customers.c.customerNumber)

print(s)

SELECT customers."customerNumber", customers."customerName", sum(orderdetails."quantityOrdered") AS "Amount Ordered"
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber"
WHERE customers."customerName" LIKE :customerName_1 AND EXTRACT(MONTH FROM orders."orderDate") = :param_1 AND EXTRACT(YEAR FROM orders."orderDate") = :param_2 GROUP BY customers."customerNumber"

In [150]:
show_dataframe(s)

    customerNumber                       customerName Amount Ordered
0              112                 Signal Gift Stores            318
1              124       Mini Gifts Distributors Ltd.            447
2              141             Euro+ Shopping Channel            236
3              148            Dragon Souveniers, Ltd.             28
4              157              Diecast Classics Inc.            449
5              204           Online Mini Collectables            527
6              249                 Amica Models & Co.            551
7              260  Royal Canadian Collectables, Ltd.            483
8              286               Marta's Replicas Co.            474
9              298                    Vida Sport, Ltd            595
10             299          Norway Gifts By Mail, Co.            418

17. Write a procedure to change the credit limit of all customers in a specified country by a specified percentage.

In [151]:
s = text("UPDATE customers SET creditLimit = creditLimit * :x WHERE  country = :y")

print(s)

UPDATE customers SET creditLimit = creditLimit * :x WHERE  country = :y

18. **Basket of goods analysis**: A common retail analytics task is to analyze each basket or order to learn what products are often purchased together. Report the names of products that appear in the same order ten or more times.

In [152]:
s = select([t_products.c.productCode, t_products.c.productName, t_orderdetails.c.orderNumber])\
    .join(t_orderdetails, t_products.c.productCode == t_orderdetails.c.productCode)\
    .where(t_orderdetails.c.quantityOrdered >= 10)\
    .group_by(t_orderdetails.c.productCode)

In [153]:
show_dataframe(s)

    productCode                          productName  orderNumber
0      S18_1749             1917 Grand Touring Sedan        10100
1      S18_2248                   1911 Ford Town Car        10100
2      S18_4409  1932 Alfa Romeo 8C2300 Spider Sport        10100
3      S24_3969     1936 Mercedes Benz 500k Roadster        10100
4      S18_2325            1932 Model A Ford J-Coupe        10101
..          ...                                  ...          ...
104    S24_1628            1966 Shelby Cobra 427 S/C        10110
105    S24_2766                   1949 Jaguar XK 120        10110
106    S24_2887                    1952 Citroen-15CV        10110
107    S24_3191            1969 Chevrolet Camaro Z28        10110
108    S24_3432                  2002 Chevy Corvette        10110

[109 rows x 3 columns]

19. **ABC reporting**: Compute the revenue generated by each customer based on their orders. Also, show each customer's revenue as a percentage of total revenue. Sort by customer name.

In [154]:
cummulative = func.sum(t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered).label('revenue')
total_revenue = select(cummulative).alias("total_revenue")

In [155]:
join_table = t_customers.join(t_orders).join(t_orderdetails)

In [156]:
s = select([t_customers.c.customerName, cummulative, func.concat((cummulative/total_revenue) * 100,"%").label('percentage') ])\
    .select_from(join_table)\
    .group_by(t_customers.c.customerName)\
    .order_by(t_customers.c.customerName.asc())

print(s)

SELECT customers."customerName", sum(orderdetails."priceEach" * orderdetails."quantityOrdered") AS revenue, concat((sum(orderdetails."priceEach" * orderdetails."quantityOrdered") / (SELECT sum(orderdetails."priceEach" * orderdetails."quantityOrdered") AS revenue
FROM orderdetails)) * :param_1, :concat_1) AS percentage
FROM customers JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" GROUP BY customers."customerName" ORDER BY customers."customerName" ASC

In [157]:
show_dataframe(s)

                    customerName    revenue percentage
0                   Alpha Cognac   60483.36  0.629760%
1             Amica Models & Co.   82223.23  0.856118%
2        Anna's Decorations, Ltd  137034.22  1.426817%
3              Atelier graphique   22314.36  0.232340%
4   Australian Collectables, Ltd   55866.02  0.581684%
..                           ...        ...        ...
93         UK Collectables, Ltd.  106610.72  1.110044%
94               Vida Sport, Ltd  108777.92  1.132609%
95               Vitachrome Inc.   72497.64  0.754854%
96      Volvo Model Replicas, Co   66694.82  0.694435%
97   West Coast Collectables Co.   43748.72  0.455517%

[98 rows x 3 columns]

20. Compute the profit generated by each customer based on their orders. Also, show each customer's profit as a percentage of total profit. Sort by profit descending.

In [158]:
cummulative = func.sum((t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered) -(t_products.c.buyPrice * t_orderdetails.c.quantityOrdered))

In [159]:
join_table = t_customers.join(t_orders).join(t_orderdetails)

In [160]:
t = select([cummulative])
total_profit = conn.execute(t).scalar()

In [161]:
s = select([t_customers.c.customerName, cummulative.label('profit'), func.concat((cummulative/total_profit) * 100,"%").label('profitPercentage') ])\
    .select_from(join_table)\
    .group_by(t_customers.c.customerName)\
    .order_by((cummulative/total_profit).desc())

print(s)

SELECT customers."customerName", sum(orderdetails."priceEach" * orderdetails."quantityOrdered" - products."buyPrice" * orderdetails."quantityOrdered") AS profit, concat((sum(orderdetails."priceEach" * orderdetails."quantityOrdered" - products."buyPrice" * orderdetails."quantityOrdered") / :sum_1) * :param_1, :concat_1) AS "profitPercentage"
FROM products, customers JOIN orders ON customers."customerNumber" = orders."customerNumber" JOIN orderdetails ON orders."orderNumber" = orderdetails."orderNumber" GROUP BY customers."customerName" ORDER BY sum(orderdetails."priceEach" * orderdetails."quantityOrdered" - products."buyPrice" * orderdetails."quantityOrdered") / :sum_2 DESC

In [162]:
show_dataframe(s)

                          customerName       profit profitPercentage
0               Euro+ Shopping Channel  34468024.71        8.108041%
1         Mini Gifts Distributors Ltd.  27010237.38        6.353718%
2                   Muscle Machine Inc   8949875.25        2.105312%
3           Australian Collectors, Co.   8340194.48        1.961895%
4              Dragon Souveniers, Ltd.   8068805.02        1.898055%
..                                 ...          ...              ...
93  Bavarian Collectables Imports, Co.   1044738.43        0.245758%
94                     Microscale Inc.    935645.23        0.220095%
95                   Atelier graphique    839042.70        0.197371%
96             Auto-Moto Classics Inc.    653712.71        0.153775%
97                   Boards & Toys Co.    260732.06        0.061333%

[98 rows x 3 columns]

21. Compute the revenue generated by each sales representative based on the orders from the customers they serve.

In [163]:
cummulative = func.sum(t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered)

In [164]:
join_table = t_employees.join(t_customers).join(t_orders).join(t_orderdetails).join(t_products)

In [165]:
s = select([t_employees.c.lastName, t_employees.c.firstName, cummulative.label('revenue')])\
    .select_from(join_table)\
    .group_by(t_employees.c.employeeNumber)\
    .order_by(t_employees.c.lastName.desc(), t_employees.c.firstName.desc())

In [166]:
show_dataframe(s)

     lastName firstName     revenue
0      Vanauf    George   669377.05
1       Tseng  Foon Yue   488212.67
2    Thompson    Leslie   347533.03
3   Patterson     Steve   505875.42
4       Nishi      Mami   457110.07
5       Marsh     Peter   584593.76
6       Jones     Barry   704853.91
7    Jennings    Leslie  1081530.54
8   Hernandez    Gerard  1258577.81
9      Gerard    Martin   387477.47
10     Fixter      Andy   562582.59
11   Firrelli     Julie   386663.20
12   Castillo    Pamela   868220.55
13       Bott     Larry   732096.79
14     Bondur      Loui   569485.75

22. Compute the profit generated by each sales representative based on the orders from the customers they serve. Sort by profit generated descending.

In [167]:
cummulative = func.sum((t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered) -(t_products.c.buyPrice * t_orderdetails.c.quantityOrdered) )

In [168]:
join_table = t_employees.join(t_customers).join(t_orders).join(t_orderdetails).join(t_products)

In [169]:
s = select([t_employees.c.lastName, t_employees.c.firstName, cummulative.label('profit')])\
    .select_from(join_table)\
    .group_by(t_employees.c.employeeNumber)\
    .order_by(cummulative.desc())

In [170]:
show_dataframe(s)

     lastName firstName     profit
0   Hernandez    Gerard  504644.71
1    Jennings    Leslie  435208.35
2    Castillo    Pamela  340727.90
3        Bott     Larry  290203.59
4       Jones     Barry  276659.25
5      Vanauf    George  269596.09
6      Bondur      Loui  234891.07
7       Marsh     Peter  230811.75
8      Fixter      Andy  222207.18
9   Patterson     Steve  197879.23
10      Tseng  Foon Yue  194839.92
11      Nishi      Mami  181181.80
12     Gerard    Martin  156878.63
13   Firrelli     Julie  152119.31
14   Thompson    Leslie  138031.47

23. Compute the revenue generated by each product, sorted by product name.

In [171]:
cummulative = func.sum(t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered).label('revenue')

In [172]:
s = select([func.distinct(t_products.c.productName).label('productName'), cummulative])\
    .join(t_orderdetails, t_products.c.productCode == t_orderdetails.c.productCode, isouter = True)\
    .group_by(t_products.c.productName)\
    .order_by(t_products.c.productName.asc())

In [173]:
show_dataframe(s)

                             productName    revenue
0                  18th century schooner  112427.12
1    18th Century Vintage Horse Carriage   85328.57
2                 1900s Vintage Bi-Plane   58434.07
3                1900s Vintage Tri-Plane   68276.35
4                      1903 Ford Model A  111528.82
..                                   ...        ...
105                        The Mayflower   69531.61
106                       The Queen Mary   78919.06
107                The Schooner Bluenose   56455.11
108                          The Titanic   84992.25
109            The USS Constitution Ship   66697.13

[110 rows x 2 columns]

24. Compute the profit generated by each product line, sorted by profit descending.

In [174]:
cummulative = func.sum((t_orderdetails.c.priceEach * t_orderdetails.c.quantityOrdered) - (t_products.c.buyPrice * t_orderdetails.c.quantityOrdered)).label('profit')

In [175]:
join_table = t_productlines.join(t_products).join(t_orderdetails, isouter=True)

In [176]:
s = select([t_productlines.c.productLine, cummulative])\
    .select_from(join_table)\
    .group_by(t_productlines.c.productLine)\
    .order_by(cummulative.desc())

25. **Same as Last Year (SALY) analysis**: Compute the ratio for each product of sales for 2003 versus 2004.

In [177]:
product_2003 = select([t_products.c.productCode, t_products.c.productName, t_orderdetails.c.quantityOrdered])\
               .join(t_orderdetails, t_products.c.productCode == t_orderdetails.c.productCode, isouter=True)\
               .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
               .where(extract('YEAR', t_orders.c.orderDate)==2003)\
               .group_by(t_products.c.productCode).alias("product_2003")

In [178]:
product_2004 = select([t_products.c.productCode, t_products.c.productName, t_orderdetails.c.quantityOrdered])\
               .join(t_orderdetails, t_products.c.productCode == t_orderdetails.c.productCode, isouter=True)\
               .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
               .where(extract('YEAR', t_orders.c.orderDate)==2004)\
               .group_by(t_products.c.productCode).alias("product_2004")

In [179]:
s = select([product_2003.c.productCode, product_2003.c.productName, product_2003.c.quantityOrdered.label("quantityOrdered2003"), product_2004.c.quantityOrdered.label("quantityOrdered2004"), func.concat(product_2003.c.quantityOrdered,"/",product_2004.c.quantityOrdered).label('ratio(2003/2004)')])\
                .join(product_2004, product_2003.c.productCode == product_2004.c.productCode)

In [180]:
show_dataframe(s)

,productCode,productName,quantityOrdered2003,quantityOrdered2004,ratio(2003/2004)
0,S18_1749,1917 Grand Touring Sedan,30,30,30/30
1,S18_2248,1911 Ford Town Car,50,21,50/21
2,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport,22,38,22/38
3,S24_3969,1936 Mercedes Benz 500k Roadster,49,44,49/44
4,S18_2325,1932 Model A Ford J-Coupe,25,27,25/27
...,...,...,...,...,...
104,S24_1628,1966 Shelby Cobra 427 S/C,29,45,29/45
105,S24_2766,1949 Jaguar XK 120,43,45,43/45
106,S24_2887,1952 Citroen-15CV,46,27,46/27
107,S24_3191,1969 Chevrolet Camaro Z28,27,27,27/27
108,S24_3432,2002 Chevy Corvette,37,46,37/46

26. Compute the ratio of payments for each customer for 2003 versus 2004.

In [181]:
payment_2003 = select([t_customers.c.customerNumber.label('customerNumber'), t_customers.c.customerName.label('customerName'), func.count(t_payments.c.checkNumber).label('payment_count')])\
               .join(t_payments, t_customers.c.customerNumber == t_payments.c.customerNumber, isouter=True)\
               .where(func.year(t_payments.c.paymentDate) == 2003)\
               .group_by(t_customers.c.customerNumber).alias('payment_2003')

In [182]:
payment_2004 = select([t_customers.c.customerNumber.label('customerNumber'), t_customers.c.customerName.label('customerName'), func.count(t_payments.c.checkNumber).label('payment_count')])\
               .join(t_payments, t_customers.c.customerNumber == t_payments.c.customerNumber, isouter=True)\
               .where(func.year(t_payments.c.paymentDate) == 2004)\
               .group_by(t_customers.c.customerNumber).alias('payment_2004')

In [183]:
s = select(payment_2003.c.customerNumber, payment_2003.c.customerName, payment_2003.c.payment_count.label('payment_count_2003'), payment_2004.c.payment_count.label('payment_count_2004'), func.concat(payment_2003.c.payment_count,"/",payment_2004.c.payment_count).label('ratio'))\
                .join(payment_2004, payment_2003.c.customerNumber == payment_2004.c.customerNumber)

print(s)

SELECT payment_2003."customerNumber", payment_2003."customerName", payment_2003.payment_count AS payment_count_2003, payment_2004.payment_count AS payment_count_2004, concat(payment_2003.payment_count, :concat_1, payment_2004.payment_count) AS ratio
FROM (SELECT customers."customerNumber" AS "customerNumber", customers."customerName" AS "customerName", count(payments."checkNumber") AS payment_count
FROM customers LEFT OUTER JOIN payments ON customers."customerNumber" = payments."customerNumber"
WHERE year(payments."paymentDate") = :year_1 GROUP BY customers."customerNumber") AS payment_2003 JOIN (SELECT customers."customerNumber" AS "customerNumber", customers."customerName" AS "customerName", count(payments."checkNumber") AS payment_count
FROM customers LEFT OUTER JOIN payments ON customers."customerNumber" = payments."customerNumber"
WHERE year(payments."paymentDate") = :year_2 GROUP BY customers."customerNumber") AS payment_2004 ON payment_2003."customerNumber" = payment_2004."customerNumber"

In [184]:
show_dataframe(s)

,customerNumber,customerName,payment_count_2003,payment_count_2004,ratio
0,103,Atelier graphique,1,2,1/2
1,112,Signal Gift Stores,1,2,1/2
2,114,"Australian Collectors, Co.",2,2,2/2
3,121,Baane Mini Imports,2,2,2/2
4,124,Mini Gifts Distributors Ltd.,3,4,3/4
...,...,...,...,...,...
58,486,Motor Mint Distributors Inc.,1,2,1/2
59,487,Signal Collectibles Ltd.,1,1,1/1
60,489,"Double Decker Gift Stores, Ltd",1,1,1/1
61,495,Diecast Collectables,1,1,1/1
62,496,Kelly's Gift Shop,1,1,1/1

27. Find the products sold in 2003 but not 2004.

In [185]:
sold_2004 = select([t_products.c.productCode])\
            .join(t_orderdetails, t_products.c.productCode == t_orderdetails.c.productCode, isouter=True)\
            .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
            .where(and_(\
                        t_orders.c.status == "Resolved",\
                        extract('YEAR',t_orders.c.orderDate) == 2004\
                        ))\
            .group_by(t_products.c.productCode).alias('sold_2004')

In [186]:
sold_2003 = select([t_products.c.productCode, t_products.c.productName, t_orders.c.status ])\
            .join(t_orderdetails,  t_products.c.productCode == t_orderdetails.c.productCode, isouter=True)\
            .join(t_orders, t_orderdetails.c.orderNumber == t_orders.c.orderNumber)\
            .where(and_(
                        t_orders.c.status == "Resolved",\
                        extract('YEAR',t_orders.c.orderDate) == 2003\
                        )).group_by(t_products.c.productCode).alias('sold_2003')

In [187]:
s = select([sold_2003.c.productCode, sold_2003.c.productName]).where(sold_2003.c.productCode.not_in(sold_2004))

In [188]:
show_dataframe(s)

  productCode                                  productName
0    S10_4962                       1962 LanciaA Delta 16V
1    S12_1666                               1958 Setra Bus
2    S18_1097                       1940 Ford Pickup Truck
3    S18_4600                             1940s Ford truck
4    S18_4668                      1939 Cadillac Limousine
5    S32_1268                  1980’s GM Manhattan Express
6    S32_3522  1996 Peterbilt 379 Stake Bed with Outrigger
7   S700_2824                              1982 Camaro Z28

28. Find the customers without payments in 2003.

In [189]:
year = extract('YEAR', t_payments.c.paymentDate)

In [190]:
pay_2003 = select([t_customers.c.customerNumber]).join(t_payments).where(year == 2003).alias("pay_2003")

In [191]:
s = select([func.distinct(t_customers.c.customerNumber).label('customerNumber'), t_customers.c.customerName])\
    .join(t_payments)\
    .where(t_customers.c.customerNumber.not_in(pay_2003))

print(s)

SELECT distinct(customers."customerNumber") AS "customerNumber", customers."customerName"
FROM customers JOIN payments ON customers."customerNumber" = payments."customerNumber"
WHERE (customers."customerNumber" NOT IN (SELECT pay_2003."customerNumber"
FROM (SELECT customers."customerNumber" AS "customerNumber"
FROM customers JOIN payments ON customers."customerNumber" = payments."customerNumber"
WHERE EXTRACT(YEAR FROM payments."paymentDate") = :param_1) AS pay_2003))

In [192]:
show_dataframe(s)

    customerNumber                        customerName
0              119                   La Rochelle Gifts
1              157               Diecast Classics Inc.
2              166                    Handji Gifts& Co
3              173          Cambridge Collectables Co.
4              177                Osaka Souveniers Co.
5              189             Clover Collections, Co.
6              204            Online Mini Collectables
7              209                         Mini Caravy
8              239        Collectable Mini Designs Co.
9              240                   giftsbymail.co.uk
10             249                  Amica Models & Co.
11             256                Auto Associés & Cie.
12             260   Royal Canadian Collectables, Ltd.
13             286                Marta's Replicas Co.
14             298                     Vida Sport, Ltd
15             314                          Petit Auto
16             328             Tekni Collectables Inc.
17             362                   Gifts4AllAges.com
18             398             Tokyo Collectables, Ltd
19             406                   Auto Canal+ Petit
20             412       Extreme Desk Decorations, Ltd
21             415  Bavarian Collectables Imports, Co.
22             448             Scandinavian Gift Ideas
23             450           The Sharp Gifts Warehouse
24             456                     Microscale Inc.

### Correlated subqueries

1. Who reports to Mary Patterson?

In [193]:
code_mary = (
    select(t_employees.c.employeeNumber)
    .where(func.concat(t_employees.c.firstName, " ", t_employees.c.lastName) == "Mary Patterson")
).alias("code_mary")

In [194]:
s = select(t_employees.c.employeeNumber, func.concat(t_employees.c.firstName," ", t_employees.c.lastName)).join(code_mary)\
    .where(t_employees.c.reportsTo == code_mary.c.employeeNumber)

print(s)

SELECT employees."employeeNumber", concat(employees."firstName", :concat_2, employees."lastName") AS concat_1
FROM employees JOIN (SELECT employees."employeeNumber" AS "employeeNumber"
FROM employees
WHERE concat(employees."firstName", :concat_3, employees."lastName") = :concat_4) AS code_mary ON code_mary."employeeNumber" = employees."reportsTo"
WHERE employees."reportsTo" = code_mary."employeeNumber"

In [195]:
show_dataframe(s)

   employeeNumber           concat_1
0            1088  William Patterson
1            1102      Gerard Bondur
2            1143        Anthony Bow
3            1621         Mami Nishi

2. Which payments in any month and year are more than twice the average for that month and year (i.e. compare all payments in Oct 2004 with the average payment for Oct 2004)? Order the results by the date of the payment. You will need to use the [date functions](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html).

In [196]:
p = t_payments.c

In [197]:
sub = (select(t_payments, func.avg(p.amount).over(func.year(p.paymentDate),func.month(p.paymentDate)).label("avg_ym"))).alias("sub")

In [198]:
s = select(sub.c.checkNumber, sub.c.amount, sub.c.paymentDate, (2*sub.c.avg_ym)).where((sub.c.amount>(2*sub.c.avg_ym))).order_by(sub.c.paymentDate)

print(s)

SELECT sub."checkNumber", sub.amount, sub."paymentDate", :avg_ym_1 * sub.avg_ym AS anon_1
FROM (SELECT payments."customerNumber" AS "customerNumber", payments."checkNumber" AS "checkNumber", payments."paymentDate" AS "paymentDate", payments.amount AS amount, avg(payments.amount) OVER (PARTITION BY year(payments."paymentDate") ORDER BY month(payments."paymentDate")) AS avg_ym
FROM payments) AS sub
WHERE sub.amount > :avg_ym_2 * sub.avg_ym ORDER BY sub."paymentDate"

In [199]:
# Window function only support in mysql 8 or higher
show_dataframe(s)

   checkNumber     amount paymentDate        anon_1
0     IP568906   58841.35  2003-06-18  58398.022758
1     KI131716  111654.40  2003-08-15  58196.427442
2      DJ15149   85559.12  2003-11-03  60589.501500
3     GN228846   85024.46  2003-12-03  65004.354000
4     KM172879  105743.00  2003-12-26  65004.354000
5     NQ865547   80375.24  2004-03-15  64818.030434
6     EF485824   59551.38  2004-06-21  55873.216596
7     BG255406   85410.87  2004-08-28  58097.246176
8     NN711988   63357.13  2004-09-07  59078.359036
9     LF501133   61402.00  2004-09-18  59078.359036
10    MA765515   82261.22  2004-12-15  63431.297794
11     ID10962  116208.40  2004-12-31  63431.297794
12    AE215433  101244.59  2005-03-05  73814.987620
13    JE105477  120166.58  2005-03-18  73814.987620
14     ET64396   83598.04  2005-04-16  73765.776154
15    AL493079   75020.13  2005-05-23  70354.515428

In [200]:
# Dapat dilihat pada bulan oktober 200 4 tidak ada pembayaran yang lebih besar 2 kali rata-rata pembayaran
s = select(sub.c.checkNumber, sub.c.amount, sub.c.paymentDate).where(and_(between(sub.c.paymentDate, '2004-10-01', '2004-10-31' ),(sub.c.amount>(2*sub.c.avg_ym)))).order_by(sub.c.paymentDate)

show_dataframe(s)

Empty DataFrame
Columns: []
Index: []

3. Report for each product, the percentage value of its stock on hand as a percentage of the stock on hand for product line to which it belongs. Order the report by product line and percentage value within product line descending. Show percentages with two decimal places.

In [201]:
total_stock = select(t_products.c.productLine, func.sum(t_products.c.quantityInStock).label('totalQuantity'))\
              .group_by(t_products.c.productLine)\
              .alias('total_stock')

In [202]:
s = select(t_products.c.productCode, t_products.c.productName, t_products.c.quantityInStock, total_stock.c.productLine, total_stock.c.totalQuantity,\
           func.concat(func.round((t_products.c.quantityInStock/total_stock.c.totalQuantity)*100,2)," ","%").label('percentage'))\
    .join(total_stock, t_products.c.productLine == total_stock.c.productLine)\
    .order_by(t_products.c.productLine.desc(), func.round((t_products.c.quantityInStock/total_stock.c.totalQuantity)*100,2).desc())

In [203]:
show_dataframe(s)

,productCode,productName,quantityInStock,productLine,totalQuantity,percentage
0,S18_2325,1932 Model A Ford J-Coupe,9354,Vintage Cars,124880,7.49 %
1,S24_3151,1912 Ford Model T Delivery Wagon,9173,Vintage Cars,124880,7.35 %
2,S18_1342,1937 Lincoln Berline,8693,Vintage Cars,124880,6.96 %
3,S18_1367,1936 Mercedes-Benz 500K Special Roadster,8635,Vintage Cars,124880,6.91 %
4,S18_4522,1904 Buick Runabout,8290,Vintage Cars,124880,6.64 %
...,...,...,...,...,...,...
105,S24_2887,1952 Citroen-15CV,1452,Classic Cars,219183,0.66 %
106,S18_4721,1957 Corvette Convertible,1249,Classic Cars,219183,0.57 %
107,S12_3891,1969 Ford Falcon,1049,Classic Cars,219183,0.48 %
108,S24_1046,1970 Chevy Chevelle SS 454,1005,Classic Cars,219183,0.46 %
109,S12_1099,1968 Ford Mustang,68,Classic Cars,219183,0.03 %

4. For orders containing more than two products, report those products that constitute more than 50% of the value of the order.

In [204]:
order_summary = select(t_orderdetails.c.orderNumber, func.count(t_orderdetails.c.productCode).label('totalProduct'))\
                .group_by(t_orderdetails.c.orderNumber).order_by(asc(t_orderdetails.c.orderNumber)).alias('order_summary')

In [205]:
perfect_order = select(order_summary.c.orderNumber)\
                .where(order_summary.c.totalProduct > 2).alias('perfect_summary')

In [206]:
product_value = select(t_orderdetails.c.orderNumber, t_products.c.productName, (t_orderdetails.c.quantityOrdered * t_orderdetails.c.priceEach).label('value'))\
    .join(t_products, t_orderdetails.c.productCode == t_products.c.productCode)\
    .where(t_orderdetails.c.orderNumber.in_(perfect_order))\
    .order_by(t_orderdetails.c.orderNumber).alias('product_value')

In [207]:
total_value = select(product_value.c.orderNumber, func.sum(product_value.c.value).label('totalValue'))\
    .group_by(product_value.c.orderNumber).alias('total_value')

In [208]:
s = select(product_value.c.orderNumber, product_value.c.productName, product_value.c.value, total_value.c.totalValue,\
           func.concat(func.round((product_value.c.value/total_value.c.totalValue)*100,2)," ","%").label("percentage")\
           )\
    .join(total_value, product_value.c.orderNumber == total_value.c.orderNumber)\
    .where((product_value.c.value/total_value.c.totalValue) > 0.5)

In [209]:
show_dataframe(s)

   orderNumber                  productName    value totalValue percentage
0        10166            1903 Ford Model A  5873.37    9977.85    58.86 %
1        10335  1980’s GM Manhattan Express  3390.20    6466.44    52.43 %
2        10199  American Airlines: B767-300  3901.92    7678.25    50.82 %

# SQL ALCHEMY ORM

## Persiapan Model

In [210]:
from sqlalchemy.orm import relationship
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()
metadata = Base.metadata

class Office(Base):
    __tablename__ = 'offices'

    officeCode = Column(String(10), primary_key=True)
    city = Column(String(50), nullable=False)
    phone = Column(String(50), nullable=False)
    addressLine1 = Column(String(50), nullable=False)
    addressLine2 = Column(String(50))
    state = Column(String(50))
    country = Column(String(50), nullable=False)
    postalCode = Column(String(15), nullable=False)
    territory = Column(String(10), nullable=False)


class Productline(Base):
    __tablename__ = 'productlines'

    productLine = Column(String(50), primary_key=True)
    textDescription = Column(String(4000))
    htmlDescription = Column(MEDIUMTEXT)
    image = Column(MEDIUMBLOB)


class Employee(Base):
    __tablename__ = 'employees'

    employeeNumber = Column(INTEGER(11), primary_key=True)
    lastName = Column(String(50), nullable=False)
    firstName = Column(String(50), nullable=False)
    extension = Column(String(10), nullable=False)
    email = Column(String(100), nullable=False)
    officeCode = Column(ForeignKey('offices.officeCode'), nullable=False, index=True)
    reportsTo = Column(ForeignKey('employees.employeeNumber'), index=True)
    jobTitle = Column(String(50), nullable=False)

    office = relationship('Office')
    parent = relationship('Employee', remote_side=[employeeNumber])


class Product(Base):
    __tablename__ = 'products'

    productCode = Column(String(15), primary_key=True)
    productName = Column(String(70), nullable=False)
    productLine = Column(ForeignKey('productlines.productLine'), nullable=False, index=True)
    productScale = Column(String(10), nullable=False)
    productVendor = Column(String(50), nullable=False)
    productDescription = Column(Text, nullable=False)
    quantityInStock = Column(SMALLINT(6), nullable=False)
    buyPrice = Column(DECIMAL(10, 2), nullable=False)
    MSRP = Column(DECIMAL(10, 2), nullable=False)

    productline = relationship('Productline')


class Customer(Base):
    __tablename__ = 'customers'

    customerNumber = Column(INTEGER(11), primary_key=True)
    customerName = Column(String(50), nullable=False)
    contactLastName = Column(String(50), nullable=False)
    contactFirstName = Column(String(50), nullable=False)
    phone = Column(String(50), nullable=False)
    addressLine1 = Column(String(50), nullable=False)
    addressLine2 = Column(String(50))
    city = Column(String(50), nullable=False)
    state = Column(String(50))
    postalCode = Column(String(15))
    country = Column(String(50), nullable=False)
    salesRepEmployeeNumber = Column(ForeignKey('employees.employeeNumber'), index=True)
    creditLimit = Column(DECIMAL(10, 2))

    employee = relationship('Employee')


class Order(Base):
    __tablename__ = 'orders'

    orderNumber = Column(INTEGER(11), primary_key=True)
    orderDate = Column(Date, nullable=False)
    requiredDate = Column(Date, nullable=False)
    shippedDate = Column(Date)
    status = Column(String(15), nullable=False)
    comments = Column(Text)
    customerNumber = Column(ForeignKey('customers.customerNumber'), nullable=False, index=True)

    customer = relationship('Customer')


class Payment(Base):
    __tablename__ = 'payments'

    customerNumber = Column(ForeignKey('customers.customerNumber'), primary_key=True, nullable=False)
    checkNumber = Column(String(50), primary_key=True, nullable=False)
    paymentDate = Column(Date, nullable=False)
    amount = Column(DECIMAL(10, 2), nullable=False)

    customer = relationship('Customer')


class Orderdetail(Base):
    __tablename__ = 'orderdetails'

    orderNumber = Column(ForeignKey('orders.orderNumber'), primary_key=True, nullable=False)
    productCode = Column(ForeignKey('products.productCode'), primary_key=True, nullable=False, index=True)
    quantityOrdered = Column(INTEGER(11), nullable=False)
    priceEach = Column(DECIMAL(10, 2), nullable=False)
    orderLineNumber = Column(SMALLINT(6), nullable=False)

    order = relationship('Order')
    product = relationship('Product')

In [211]:
Session = sessionmaker(bind = engine)
session = Session()

## Code

### A. Single entity

1. Prepare a list of offices sorted by country, state, city.

In [212]:
q = session.query(Office).order_by(Office.country, Office.state, Office.city)

In [213]:
show_df_orm(q)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
1,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,None,None,France,75017,EMEA
2,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
3,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA
4,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
5,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
6,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA

2. How many employees are there in the company?

In [214]:
q = session.query(Employee).count()

In [215]:
print("Number of company %d"%q)

Number of company 23

3. What is the total of payments received?

In [216]:
q = session.query(func.sum(Payment.amount))

In [217]:
print("Total payment: %.2f"%q.scalar())

Total payment: 8853839.23

4. List the product lines that contain 'Cars'.

In [218]:
q = session.query(Productline).filter(Productline.productLine.like('%Cars%'))

In [219]:
show_df_orm(q)

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

5. Report total payments for October 28, 2004.

In [220]:
q = session.query(func.sum(Payment.amount)).filter(Payment.paymentDate == '2004-10-28').scalar()

In [221]:
print("Total payment on october 28th 2004: %.2f"%q)

Total payment on october 28th 2004: 47411.33

6. Report those payments greater than $100,000.

In [222]:
q = result = session.query(Payment).filter(Payment.amount > 100000)

In [223]:
show_df_orm(q)

   customerNumber checkNumber paymentDate     amount
0             124    AE215433  2005-03-05  101244.59
1             124    KI131716  2003-08-15  111654.40
2             141     ID10962  2004-12-31  116208.40
3             141    JE105477  2005-03-18  120166.58
4             148    KM172879  2003-12-26  105743.00

7. List the products in each product line.

In [224]:
q = session.query(Product.productLine, Product.productName).order_by(Product.productLine)

In [225]:
show_df_orm(q)

      productLine                       productName
0    Classic Cars          1952 Alpine Renault 1300
1    Classic Cars               1972 Alfa Romeo GTA
2    Classic Cars            1962 LanciaA Delta 16V
3    Classic Cars                 1968 Ford Mustang
4    Classic Cars                 2001 Ferrari Enzo
..            ...                               ...
105  Vintage Cars          1940 Ford Delivery Sedan
106  Vintage Cars  1936 Mercedes Benz 500k Roadster
107  Vintage Cars             1936 Chrysler Airflow
108  Vintage Cars          1928 Ford Phaeton Deluxe
109  Vintage Cars      1930 Buick Marquette Phaeton

[110 rows x 2 columns]

8. How many products in each product line?

In [226]:
q =  session.query(Product.productLine, func.count(Product.productName)).group_by(Product.productLine)

In [227]:
show_df_orm(q)

        productLine  count_1
0      Classic Cars       38
1       Motorcycles       13
2            Planes       12
3             Ships        9
4            Trains        3
5  Trucks and Buses       11
6      Vintage Cars       24

9. What is the minimum payment received?

In [228]:
q = session.query(func.min(Payment.amount)).scalar()

In [229]:
print("Minimum payment received: %.2f"%q)

Minimum payment received: 615.45

10. List all payments greater than twice the average payment.

In [230]:
avg_payment = session.query(func.avg(Payment.amount)).scalar()
print("Average payment: ",avg_payment)
print("Twice average payment: ",avg_payment*2)
print()
q = session.query(Payment).filter(Payment.amount > (avg_payment*2)).order_by(Payment.amount)

Average payment:  32431.645531
Twice average payment:  64863.291062

In [231]:
show_df_orm(q)

    customerNumber checkNumber paymentDate     amount
0              141    IN446258  2005-03-25   65071.26
1              323    AL493079  2005-05-23   75020.13
2              239    NQ865547  2004-03-15   80375.24
3              114    MA765515  2004-12-15   82261.22
4              124     ET64396  2005-04-16   83598.04
5              167    GN228846  2003-12-03   85024.46
6              124    BG255406  2004-08-28   85410.87
7              321     DJ15149  2003-11-03   85559.12
8              124    AE215433  2005-03-05  101244.59
9              148    KM172879  2003-12-26  105743.00
10             124    KI131716  2003-08-15  111654.40
11             141     ID10962  2004-12-31  116208.40
12             141    JE105477  2005-03-18  120166.58

11. What is the average percentage markup of the MSRP on buyPrice?

In [232]:
q = session.query(func.avg(Product.buyPrice/Product.MSRP*100)).scalar()

In [233]:
print("Average percentage markup MSRP/buyPrice = %d%%"%q)

Average percentage markup MSRP/buyPrice = 54%

12. How many distinct products does ClassicModels sell?

In [234]:
q = session.query(func.count(distinct(Product.productName))).all()
print(f"Total distinct products: %d"%q[0][0])

Total distinct products: 110

13. Report the name and city of customers who don't have sales representatives?

In [235]:
q = session.query(Customer.customerName, Customer.city).filter(text("customers.salesRepEmployeeNumber IS NULL"))

In [236]:
show_df_orm(q)

                      customerName              city
0               Havel & Zbyszek Co          Warszawa
1                Porto Imports Co.            Lisboa
2       Asian Shopping Network, Co         Singapore
3                  Natürlich Autos         Cunewalde
4                    ANG Resellers            Madrid
5         Messner Shopping Network         Frankfurt
6                Franken Gifts, Co           München
7                BG&E Collectables          Fribourg
8                 Schuyler Imports         Amsterdam
9                 Der Hund Imports            Berlin
10       Cramer Spezialitäten, Ltd       Brandenburg
11           Asian Treasures, Inc.              Cork
12            SAR Distributors, Co          Hatfield
13                 Kommission Auto           Münster
14          Lisboa Souveniers, Inc            Lisboa
15  Stuttgart Collectable Exchange         Stuttgart
16        Feuer Online Stores, Inc           Leipzig
17                Warburg Exchange            Aachen
18             Anton Designs, Ltd.            Madrid
19             Mit Vergnügen & Co.          Mannheim
20       Kremlin Collectables, Co.  Saint Petersburg
21              Raanan Stores, Inc           Herzlia

14. What are the names of executives with VP or Manager in their title? Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [237]:
q = session.query(func.concat(Employee.firstName," ", Employee.lastName).label("Full Name")).filter(or_(Employee.jobTitle.contains('VP'), Employee.jobTitle.contains('Manager')))

In [238]:
show_df_orm(q)

           Full Name
0     Mary Patterson
1      Jeff Firrelli
2  William Patterson
3      Gerard Bondur
4        Anthony Bow

15. Which orders have a value greater than $5,000?

In [239]:
q = session.query(Orderdetail, (Orderdetail.priceEach * Orderdetail.quantityOrdered).label("value"))\
    .filter((Orderdetail.quantityOrdered*Orderdetail.priceEach) > 5000).order_by((Orderdetail.quantityOrdered*Orderdetail.priceEach))

In [240]:
show_df_orm(q)

,orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber,value
0,10418,S32_4485,50,100.01,9,5000.50
1,10103,S10_4962,42,119.67,4,5026.14
2,10403,S24_1578,46,109.32,8,5028.72
3,10342,S18_3232,30,167.65,4,5029.50
4,10178,S18_3856,48,104.81,9,5030.88
...,...,...,...,...,...,...
405,10312,S10_1949,48,214.30,3,10286.40
406,10404,S12_1099,64,163.44,3,10460.16
407,10407,S18_1749,76,141.10,2,10723.60
408,10405,S12_4675,97,115.16,5,11170.52
409,10403,S10_4698,66,174.29,9,11503.14

### B. One to many relationship

1. Report the account representative for each customer.

In [241]:
q = session.query(func.concat(Employee.firstName," ", Employee.lastName), Customer.customerName)\
  .join(Employee)

In [242]:
show_df_orm(q)

           concat_1                  customerName
0   Leslie Jennings  Mini Gifts Distributors Ltd.
1   Leslie Jennings               Mini Wheels Co.
2   Leslie Jennings          Technics Stores Inc.
3   Leslie Jennings      Corporate Gift Ideas Co.
4   Leslie Jennings     The Sharp Gifts Warehouse
..              ...                           ...
95    Martin Gerard               Vida Sport, Ltd
96    Martin Gerard                   CAF Imports
97    Martin Gerard         Precious Collectables
98    Martin Gerard    Corrida Auto Replicas, Ltd
99    Martin Gerard    Iberia Gift Imports, Corp.

[100 rows x 2 columns]

2. Report total payments for Atelier graphique.

In [243]:
q = session.query(func.sum(Payment.amount).label("Total Payments"))\
    .join(Customer).group_by(Customer.customerNumber)\
    .filter(Customer.customerName == 'Atelier graphique')

In [244]:
show_df_orm(q)

   Total Payments
0        22314.36

3. Report the total payments by date

In [245]:
q = session.query(Payment.paymentDate, func.sum(Payment.amount)).group_by(Payment.paymentDate)

In [246]:
show_df_orm(q)

    paymentDate     sum_1
0    2004-10-19   6066.78
1    2003-06-05  14571.44
2    2004-12-18   1676.14
3    2004-12-17  40495.25
4    2003-06-06  32641.98
..          ...       ...
227  2004-02-29  12573.28
228  2004-01-31   7310.42
229  2004-05-14   6276.60
230  2005-05-25  30253.75
231  2003-07-16  32077.44

[232 rows x 2 columns]

4. Report the products that have not been sold.

In [247]:
q = session.query(Product, func.sum(Orderdetail.quantityOrdered))\
    .join(Orderdetail, isouter=True)\
    .group_by(Product.productCode)\
    .filter(Orderdetail.quantityOrdered == None)

In [248]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP,sum_1
0,S18_3233,1985 Toyota Supra,Classic Cars,1:18,Highway 66 Mini Classics,"This model features soft rubber tires, working...",7733,57.01,107.57,None

5. List the amount paid by each customer.

In [249]:
q = session.query(Customer.customerName, func.sum(Payment.amount)).join(Payment).group_by(Customer.customerName)

In [250]:
show_df_orm(q)

                      customerName      sum_1
0                Atelier graphique   22314.36
1               Signal Gift Stores   80180.98
2       Australian Collectors, Co.  180585.07
3                La Rochelle Gifts  116949.68
4               Baane Mini Imports  104224.79
..                             ...        ...
93    Motor Mint Distributors Inc.   77726.59
94        Signal Collectibles Ltd.   42570.37
95  Double Decker Gift Stores, Ltd   29586.15
96            Diecast Collectables   65541.74
97               Kelly's Gift Shop  114497.19

[98 rows x 2 columns]

6. How many orders have been placed by Herkku Gifts?

In [251]:
q = session.query(func.count(Customer.customerName)).join(Order).filter(Customer.customerName == 'Herkku Gifts')
print(q)

SELECT count(customers.`customerName`) AS count_1
FROM customers INNER JOIN orders ON customers.`customerNumber` = orders.`customerNumber`
WHERE customers.`customerName` = %(customerName_1)s

In [252]:
print(q.scalar())

3

7. Who are the employees in Boston?

In [253]:
q = session.query(func.concat(Employee.firstName, Employee.lastName)).join(Office).filter(Office.city ==  'Boston')

In [254]:
show_df_orm(q)

         concat_1
0   JulieFirrelli
1  StevePatterson

8. Report those payments greater than $100,000. Sort the report so the customer who made the highest payment appears first.

In [255]:
q = session.query(Customer.customerName, func.sum(Payment.amount))\
    .join(Payment).group_by(Customer.customerName)\
    .order_by(desc(func.sum(Payment.amount)))

In [256]:
show_df_orm(q)

                    customerName      sum_1
0         Euro+ Shopping Channel  715738.98
1   Mini Gifts Distributors Ltd.  584188.24
2     Australian Collectors, Co.  180585.07
3             Muscle Machine Inc  177913.95
4        Dragon Souveniers, Ltd.  156251.03
..                           ...        ...
93                  Royale Belge   29217.18
94            Frau da Collezione   25358.32
95             Atelier graphique   22314.36
96       Auto-Moto Classics Inc.   21554.26
97             Boards & Toys Co.    7918.60

[98 rows x 2 columns]

9. List the value of 'On Hold' orders.

In [257]:
q = session.query(Orderdetail.orderNumber, (Orderdetail.priceEach * Orderdetail.quantityOrdered)).join(Order).filter(Order.status == 'On Hold')

In [258]:
show_df_orm(q)

    orderNumber    anon_1
0         10334   3380.26
1         10334   4968.00
2         10334   1797.58
3         10334   2946.60
4         10334   4983.79
5         10334   4937.94
6         10401   3157.98
7         10401   3326.52
8         10401   3799.68
9         10401   3428.36
10        10401   4013.59
11        10401   3881.20
12        10401   2321.76
13        10401    854.04
14        10401   8391.20
15        10401   2018.31
16        10401   5667.20
17        10401   2665.20
18        10407   6754.32
19        10407  10723.60
20        10407   2441.04
21        10407   5412.00
22        10407    546.66
23        10407   4233.24
24        10407   1777.10
25        10407   2929.92
26        10407   6215.28
27        10407   5820.35
28        10407   1001.65
29        10407   4374.39
30        10414   5597.76
31        10414   3406.48
32        10414   5263.99
33        10414   4114.08
34        10414   4669.28
35        10414   4650.02
36        10414   4354.80
37        10414   3720.96
38        10414   2294.00
39        10414   2532.32
40        10414   1904.64
41        10414   2355.92
42        10414   3376.40
43        10414   2566.20

10. Report the number of orders 'On Hold' for each customer.

In [259]:
q = session.query(Orderdetail.orderNumber, func.count(Orderdetail.orderNumber)).join(Order).filter(Order.status == 'On Hold').group_by(Order.customerNumber)

In [260]:
show_df_orm(q)

   orderNumber  count_1
0        10334        6
1        10401       12
2        10407       12
3        10414       14

### C. Many to many relationship

1. List products sold by order date.

In [261]:
q = session.query(Product.productCode, Order.orderDate)\
    .join(Orderdetail, Orderdetail.productCode == Product.productCode)\
    .join(Order, Order.orderNumber == Orderdetail.orderNumber).order_by(Order.orderDate)

In [262]:
show_df_orm(q)

     productCode   orderDate
0       S18_1749  2003-01-06
1       S18_2248  2003-01-06
2       S18_4409  2003-01-06
3       S24_3969  2003-01-06
4       S18_2325  2003-01-09
...          ...         ...
2991    S32_1268  2005-05-31
2992    S32_2509  2005-05-31
2993    S32_3522  2005-05-31
2994    S50_1392  2005-05-31
2995    S18_4668  2005-05-31

[2996 rows x 2 columns]

2. List the order dates in descending order for orders for the 1940 Ford Pickup Truck.

In [263]:
q = session.query(Order.orderDate).join(Orderdetail, Orderdetail.orderNumber == Order.orderNumber).join(Product, Product.productCode == Orderdetail.productCode).filter(Product.productName == '1940 Ford Pickup Truck').order_by(desc(Order.orderDate))

In [264]:
show_df_orm(q)

     orderDate
0   2005-05-31
1   2005-05-01
2   2005-03-09
3   2005-02-17
4   2005-01-20
5   2004-12-10
6   2004-11-29
7   2004-11-18
8   2004-11-04
9   2004-10-21
10  2004-10-11
11  2004-09-08
12  2004-08-17
13  2004-07-19
14  2004-06-15
15  2004-05-04
16  2004-03-10
17  2004-01-29
18  2003-12-05
19  2003-11-25
20  2003-11-13
21  2003-11-06
22  2003-10-21
23  2003-09-19
24  2003-07-24
25  2003-05-28
26  2003-03-26
27  2003-01-29

3. List the names of customers and their corresponding order number where a particular order from that customer has a value greater than $25,000?

In [265]:
q = session.query(Customer.customerName, Order.orderNumber, func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered))\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .group_by(Orderdetail.orderNumber)\
    .having(func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered) > 25000.0)

In [266]:
show_df_orm(q)

                   customerName  orderNumber     sum_1
0            Signal Gift Stores        10124  32641.98
1            Signal Gift Stores        10278  33347.88
2    Australian Collectors, Co.        10120  45864.03
3    Australian Collectors, Co.        10223  44894.74
4    Australian Collectors, Co.        10342  40265.60
..                          ...          ...       ...
187    Signal Collectibles Ltd.        10149  29997.09
188        Diecast Collectables        10207  59265.14
189           Kelly's Gift Shop        10138  32077.44
190           Kelly's Gift Shop        10360  52166.00
191           Kelly's Gift Shop        10399  30253.75

[192 rows x 3 columns]

4. Are there any products that appear on all orders?

In [267]:
order_number_count = session.query(func.count(Order.orderNumber)).scalar()
print('order number count:', order_number_count)

q = session.query(Product.productName, func.count(Orderdetail.orderNumber))\
        .join(Orderdetail, Product.productCode == Orderdetail.productCode)\
        .group_by(Orderdetail.productCode)

order number count: 326

In [268]:
show_df_orm(q)

                               productName  count_1
0    1969 Harley Davidson Ultimate Chopper       28
1                 1952 Alpine Renault 1300       28
2                    1996 Moto Guzzi 1100i       28
3     2003 Harley-Davidson Eagle Drag Bike       28
4                      1972 Alfa Romeo GTA       28
..                                     ...      ...
104                            The Titanic       27
105                         The Queen Mary       27
106              American Airlines: MD-11S       28
107                       Boeing X-32A JSF       28
108                             Pont Yacht       27

[109 rows x 2 columns]

5. List the names of products sold at less than 80% of the MSRP.

In [269]:
q = session.query(Product.productName, Product.MSRP)\
    .join(Orderdetail, Orderdetail.productCode == Product.productCode).join(Order, Order.orderNumber == Orderdetail.orderNumber)\
    .filter(Orderdetail.priceEach < (Product.MSRP * .8))

In [270]:
show_df_orm(q)

                  productName    MSRP
0    1952 Alpine Renault 1300  214.30
1       1996 Moto Guzzi 1100i  118.94
2         1972 Alfa Romeo GTA  136.00
3           1957 Chevy Pickup  118.50
4           1957 Chevy Pickup  118.50
..                        ...     ...
56            1982 Camaro Z28  101.15
57              ATA: B757-300  118.65
58  American Airlines: MD-11S   74.03
59                 Pont Yacht   54.60
60                 Pont Yacht   54.60

[61 rows x 2 columns]

6. Reports those products that have been sold with a markup of 100% or more (i.e.,  the priceEach is at least twice the buyPrice)

In [271]:
q = session.query(Product.productName, Product.buyPrice, Orderdetail.priceEach)\
    .join(Orderdetail, Orderdetail.productCode == Product.productCode)\
    .filter(Orderdetail.priceEach >= (2 * Product.buyPrice))\
    .group_by(Product.productName)

In [272]:
show_df_orm(q)

                                  productName  buyPrice  priceEach
0                    1952 Alpine Renault 1300     98.58     214.30
1        2003 Harley-Davidson Eagle Drag Bike     91.02     187.85
2                           1968 Ford Mustang     95.34     190.68
3                           2001 Ferrari Enzo     95.59     205.72
4                            2002 Suzuki XREO     66.27     146.10
5                            1969 Ford Falcon     83.05     173.02
6                     1970 Plymouth Hemi Cuda     31.92      75.81
7                           1957 Chevy Pickup     55.70     114.95
8                      1940 Ford Pickup Truck     58.33     116.67
9    1936 Mercedes-Benz 500K Special Roadster     24.26      48.52
10                1980s Black Hawk Helicopter     77.27     157.69
11                  1932 Model A Ford J-Coupe     58.48     125.86
12                      1926 Ford Fire Engine     24.92      58.34
13        1936 Harley Davidson El Knucklehead     24.23      52.70
14                     1928 Mercedes-Benz SSK     72.56     167.06
15               1999 Indy 500 Monte Carlo SS     56.76     126.72
16                1992 Ferrari 360 Spider red     77.90     165.95
17                      1976 Ford Gran Torino     73.49     146.99
18             1948 Porsche Type 356 Roadster     62.16     125.74
19        1932 Alfa Romeo 8C2300 Spider Sport     43.26      88.35
20                    1939 Cadillac Limousine     23.14      47.29
21                  1957 Corvette Convertible     69.93     139.87
22                      1957 Ford Thunderbird     34.21      69.84
23                   1960 BSA Gold Star DBD34     37.32      75.41
24  1938 Cadillac V-16 Presidential Limousine     20.61      44.35
25                   1962 Volkswagen Microbus     61.34     122.68
26        1958 Chevy Corvette Limited Edition     15.91      34.30
27                    1982 Lamborghini Diablo     16.24      34.74
28                  1937 Horch 930V Limousine     26.30      55.89
29                   Corsair F4U ( Bird Cage)     29.34      62.10
30                      1961 Chevrolet Impala     32.33      67.10
31                1954 Greyhound Scenicruiser     25.98      53.03
32     1950's Chicago Surface Lines Streetcar     26.72      56.55
33                   1928 Ford Phaeton Deluxe     33.02      68.79
34                         2002 Yamaha YZR M1     34.17      74.85
35                              The Mayflower     43.30      86.61
36                                 HMS Bounty     39.83      85.09
37                  The USS Constitution Ship     33.97      72.28
38                            1982 Camaro Z28     46.53      94.07
39                  American Airlines: MD-11S     36.27      74.03

7. List the products ordered on a Monday.

In [273]:
q = session.query(Product.productName, Order.orderDate, func.dayname(Order.orderDate)).join(Orderdetail, Orderdetail.productCode == Product.productCode).join(Order, Order.orderNumber == Orderdetail.orderNumber).filter(func.dayname(Order.orderDate) == "Monday").group_by(Order.orderDate)

In [274]:
show_df_orm(q)

                                productName   orderDate dayname_1
0     1969 Harley Davidson Ultimate Chopper  2003-02-24    Monday
1     1969 Harley Davidson Ultimate Chopper  2003-08-25    Monday
2     1969 Harley Davidson Ultimate Chopper  2003-12-01    Monday
3     1969 Harley Davidson Ultimate Chopper  2004-04-05    Monday
4     1969 Harley Davidson Ultimate Chopper  2004-06-28    Monday
5     1969 Harley Davidson Ultimate Chopper  2004-11-15    Monday
6                  1952 Alpine Renault 1300  2003-03-24    Monday
7                  1952 Alpine Renault 1300  2003-10-20    Monday
8                  1952 Alpine Renault 1300  2004-07-19    Monday
9                  1952 Alpine Renault 1300  2004-10-11    Monday
10                 1952 Alpine Renault 1300  2004-11-29    Monday
11                    1996 Moto Guzzi 1100i  2004-01-12    Monday
12                    1996 Moto Guzzi 1100i  2004-09-27    Monday
13                      1972 Alfa Romeo GTA  2003-04-28    Monday
14                      1972 Alfa Romeo GTA  2003-10-06    Monday
15                      1972 Alfa Romeo GTA  2004-11-01    Monday
16                      1972 Alfa Romeo GTA  2005-01-31    Monday
17                        1968 Ford Mustang  2003-03-03    Monday
18                        1968 Ford Mustang  2004-08-02    Monday
19                        1968 Ford Mustang  2004-08-30    Monday
20                           1958 Setra Bus  2004-02-02    Monday
21                       1969 Corvair Monza  2004-03-15    Monday
22                       1969 Dodge Charger  2004-04-12    Monday
23                          1993 Mazda RX-7  2003-03-10    Monday
24                     1937 Lincoln Berline  2004-07-12    Monday
25                     1937 Lincoln Berline  2005-05-30    Monday
26              1980s Black Hawk Helicopter  2003-02-17    Monday
27              1980s Black Hawk Helicopter  2003-06-16    Monday
28              1980s Black Hawk Helicopter  2004-11-22    Monday
29                 1917 Grand Touring Sedan  2003-01-06    Monday
30                 1917 Grand Touring Sedan  2003-07-07    Monday
31                 1917 Grand Touring Sedan  2004-01-26    Monday
32                         1995 Honda Civic  2005-01-10    Monday
33                   1964 Mercedes Tour Bus  2004-02-09    Monday
34                1932 Model A Ford J-Coupe  2004-04-26    Monday
35              1913 Ford Model T Speedster  2004-06-14    Monday
36                     1969 Dodge Super Bee  2005-05-16    Monday
37  1941 Chevrolet Special Deluxe Cabriolet  2005-05-09    Monday
38                    1957 Ford Thunderbird  2004-08-09    Monday
39         1912 Ford Model T Delivery Wagon  2004-03-29    Monday
40                 1940 Ford Delivery Sedan  2005-02-28    Monday
41                            The Mayflower  2005-03-28    Monday
42                              The Titanic  2003-04-21    Monday

8. What is the quantity on hand for products listed on 'On Hold' orders?

In [275]:
q = session.query(Product.productName, Order.status, Product.quantityInStock).join(Orderdetail, Orderdetail.productCode == Product.productCode).join(Order, Order.orderNumber == Orderdetail.orderNumber).filter(Order.status == 'On Hold')

In [276]:
show_df_orm(q)

                            productName   status  quantityInStock
0                1962 LanciaA Delta 16V  On Hold             6791
1                1964 Mercedes Tour Bus  On Hold             8258
2                 1926 Ford Fire Engine  On Hold             2018
3           1992 Ferrari 360 Spider red  On Hold             8347
4                      1940s Ford truck  On Hold             3128
5              1962 Volkswagen Microbus  On Hold             2327
6                        P-51-D Mustang  On Hold              992
7      1928 British Royal Navy Airplane  On Hold             3627
8              Corsair F4U ( Bird Cage)  On Hold             6812
9               1900s Vintage Tri-Plane  On Hold             2756
10                     1997 BMW F650 ST  On Hold              178
11             1928 Ford Phaeton Deluxe  On Hold              136
12         1930 Buick Marquette Phaeton  On Hold             7062
13          American Airlines: B767-300  On Hold             5841
14       America West Airlines B757-200  On Hold             9653
15                        ATA: B757-300  On Hold             7106
16                   F/A 18 Hornet 1/72  On Hold              551
17            American Airlines: MD-11S  On Hold             8820
18                1965 Aston Martin DB5  On Hold             9042
19             1917 Grand Touring Sedan  On Hold             2724
20                   1911 Ford Town Car  On Hold              540
21         1999 Indy 500 Monte Carlo SS  On Hold             8164
22  1932 Alfa Romeo 8C2300 Spider Sport  On Hold             6553
23                1957 Ford Thunderbird  On Hold             3209
24           1970 Chevy Chevelle SS 454  On Hold             1005
25            1966 Shelby Cobra 427 S/C  On Hold             8197
26                   1949 Jaguar XK 120  On Hold             2350
27                    1952 Citroen-15CV  On Hold             1452
28            1969 Chevrolet Camaro Z28  On Hold             4695
29                  2002 Chevy Corvette  On Hold             9446
30                  1972 Alfa Romeo GTA  On Hold             3252
31               1999 Yamaha Speed Boat  On Hold             4259
32                    1903 Ford Model A  On Hold             3913
33             Collectable Wooden Train  On Hold             6450
34                  1904 Buick Runabout  On Hold             8290
35                18th century schooner  On Hold             1898
36     1912 Ford Model T Delivery Wagon  On Hold             9173
37             1940 Ford Delivery Sedan  On Hold             6621
38                The Schooner Bluenose  On Hold             1897
39                        The Mayflower  On Hold              737
40            The USS Constitution Ship  On Hold             7083
41                          The Titanic  On Hold             1956
42                       The Queen Mary  On Hold             5088
43                           Pont Yacht  On Hold              414

### D. Regular expressions

1. Find products containing the name 'Ford'.

In [277]:
q = session.query(Product).filter(Product.productName.regexp_match('Ford'))

In [278]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S12_1099,1968 Ford Mustang,Classic Cars,1:12,Autoart Studio Design,"Hood, doors and trunk all open to reveal highl...",68,95.34,194.57
1,S12_3891,1969 Ford Falcon,Classic Cars,1:12,Second Gear Diecast,Turnable front wheels; steering function; deta...,1049,83.05,173.02
2,S18_1097,1940 Ford Pickup Truck,Trucks and Buses,1:18,Studio M Art Models,"This model features soft rubber tires, working...",2613,58.33,116.67
3,S18_2248,1911 Ford Town Car,Vintage Cars,1:18,Motor City Art Classics,"Features opening hood, opening doors, opening ...",540,33.30,60.54
4,S18_2325,1932 Model A Ford J-Coupe,Vintage Cars,1:18,Autoart Studio Design,This model features grille-mounted chrome horn...,9354,58.48,127.13
5,S18_2432,1926 Ford Fire Engine,Trucks and Buses,1:18,Carousel DieCast Legends,Gleaming red handsome appearance. Everything i...,2018,24.92,60.77
6,S18_2949,1913 Ford Model T Speedster,Vintage Cars,1:18,Carousel DieCast Legends,This 250 part reproduction includes moving han...,4189,60.78,101.31
7,S18_2957,1934 Ford V8 Coupe,Vintage Cars,1:18,Min Lin Diecast,"Chrome Trim, Chrome Grille, Opening Hood, Open...",5649,34.35,62.46
8,S18_3140,1903 Ford Model A,Vintage Cars,1:18,Unimax Art Galleries,"Features opening trunk, working steering system",3913,68.30,136.59
9,S18_3482,1976 Ford Gran Torino,Classic Cars,1:18,Gearbox Collectibles,"Highly detailed 1976 Ford Gran Torino ""Starsky...",9127,73.49,146.99
10,S18_4600,1940s Ford truck,Trucks and Buses,1:18,Motor City Art Classics,This 1940s Ford Pick-Up truck is re-created in...,3128,84.76,121.08
11,S18_4933,1957 Ford Thunderbird,Classic Cars,1:18,Studio M Art Models,"This 1:18 scale precision die-cast replica, wi...",3209,34.21,71.27
12,S24_3151,1912 Ford Model T Delivery Wagon,Vintage Cars,1:24,Min Lin Diecast,"This model features chrome trim and grille, op...",9173,46.91,88.51
13,S24_3816,1940 Ford Delivery Sedan,Vintage Cars,1:24,Carousel DieCast Legends,"Chrome Trim, Chrome Grille, Opening Hood, Open...",6621,48.64,83.86
14,S32_4289,1928 Ford Phaeton Deluxe,Vintage Cars,1:32,Highway 66 Mini Classics,This model features grille-mounted chrome horn...,136,33.02,68.79

2. List products ending in 'ship'.

In [279]:
q = session.query(Product).filter(Product.productName.regexp_match('ship$'))

In [280]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S700_2610,The USS Constitution Ship,Ships,1:700,Red Start Diecast,"All wood with canvas sails. Measures 31 1/2"" L...",7083,33.97,72.28

3. Report the number of customers in Denmark, Norway, and Sweden.

In [281]:
q = session.query(Customer.country, func.count(Customer.country))\
  .group_by(Customer.country)\
  .filter(Customer.country.in_(['Denmark', 'Norway', 'Sweden']))

In [282]:
show_df_orm(q)

   country  count_1
0   Norway        3
1   Sweden        2
2  Denmark        2

4. What are the products with a product code in the range S700_1000 to S700_1499?

In [283]:
q = session.query(Product.productCode, Product.productName)\
         .filter(Product.productCode.between('S700_1000','S700_1499'))

In [284]:
show_df_orm(q)

  productCode            productName
0   S700_1138  The Schooner Bluenose

5. Which customers have a digit in their name?

In [285]:
q =  session.query(Customer).filter(Customer.customerName.regexp_match('[0-9]+'))

In [286]:
show_df_orm(q)

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,205,Toys4GrownUps.com,Young,Julie,6265557265,78934 Hillside Dr.,None,Pasadena,CA,90003,USA,1166,90700.0
1,362,Gifts4AllAges.com,Yoshido,Juri,6175559555,8616 Spinnaker Dr.,None,Boston,MA,51003,USA,1216,41900.0

6. List the names of employees called Dianne or Diane.

In [287]:
q = session.query(Employee)\
    .filter(or_(Employee.lastName.regexp_match("Dian{1,2}e"), Employee.firstName.regexp_match("Dian{1,2}e")))

In [288]:
show_df_orm(q)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President

7. List the products containing ship or boat in their product name.

In [289]:
q = session.query(Product).filter(Product.productName.regexp_match("([Bb]oat|[Ss]hip)"))

In [290]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S18_3029,1999 Yamaha Speed Boat,Ships,1:18,Min Lin Diecast,Exact replica. Wood and Metal. Many extras inc...,4259,51.61,86.02
1,S700_2610,The USS Constitution Ship,Ships,1:700,Red Start Diecast,"All wood with canvas sails. Measures 31 1/2"" L...",7083,33.97,72.28

8. List the products with a product code beginning with S700.

In [291]:
q =  session.query(Product).filter(Product.productCode.regexp_match('^(S700).+'))

In [292]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S700_1138,The Schooner Bluenose,Ships,1:700,Autoart Studio Design,All wood with canvas sails. Measures 31 1/2 in...,1897,34.00,66.67
1,S700_1691,American Airlines: B767-300,Planes,1:700,Min Lin Diecast,Exact replia with official logos and insignias...,5841,51.15,91.34
2,S700_1938,The Mayflower,Ships,1:700,Studio M Art Models,Measures 31 1/2 inches Long x 25 1/2 inches Hi...,737,43.30,86.61
3,S700_2047,HMS Bounty,Ships,1:700,Unimax Art Galleries,Measures 30 inches Long x 27 1/2 inches High x...,3501,39.83,90.52
4,S700_2466,America West Airlines B757-200,Planes,1:700,Motor City Art Classics,Official logos and insignias. Working steering...,9653,68.80,99.72
5,S700_2610,The USS Constitution Ship,Ships,1:700,Red Start Diecast,"All wood with canvas sails. Measures 31 1/2"" L...",7083,33.97,72.28
6,S700_2824,1982 Camaro Z28,Classic Cars,1:18,Carousel DieCast Legends,Features include opening and closing doors. Co...,6934,46.53,101.15
7,S700_2834,ATA: B757-300,Planes,1:700,Highway 66 Mini Classics,Exact replia with official logos and insignias...,7106,59.33,118.65
8,S700_3167,F/A 18 Hornet 1/72,Planes,1:72,Motor City Art Classics,"10"" Wingspan with retractable landing gears.Co...",551,54.40,80.00
9,S700_3505,The Titanic,Ships,1:700,Carousel DieCast Legends,"Completed model measures 19 1/2 inches long, 9...",1956,51.09,100.17
10,S700_3962,The Queen Mary,Ships,1:700,Welly Diecast Productions,Exact replica. Wood and Metal. Many extras inc...,5088,53.63,99.31
11,S700_4002,American Airlines: MD-11S,Planes,1:700,Second Gear Diecast,Polished finish. Exact replia with official lo...,8820,36.27,74.03

9. List the names of employees called Larry or Barry.

In [293]:
q = session.query(Employee).filter(or_(Employee.lastName.regexp_match("[LB]arry"), Employee.firstName.regexp_match("[LB]arry")))

In [294]:
show_df_orm(q)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102,Sales Rep
1,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102,Sales Rep

10. List the names of employees with non-alphabetic characters in their names.

In [295]:
q = session.query(Employee).filter(or_(Employee.lastName.regexp_match('[^A-Za-z]'), Employee.firstName.regexp_match('[^A-Za-z]')))

In [296]:
show_df_orm(q)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143,Sales Rep

11. List the vendors whose name ends in Diecast

In [297]:
q = session.query(Product).group_by(Product.productVendor).filter(Product.productVendor.regexp_match("Diecast$"))

In [298]:
show_df_orm(q)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_4698,2003 Harley-Davidson Eagle Drag Bike,Motorcycles,1:10,Red Start Diecast,"Model features, official Harley Davidson logos...",5582,91.02,193.66
2,S10_4962,1962 LanciaA Delta 16V,Classic Cars,1:10,Second Gear Diecast,Features include: Turnable front wheels; steer...,6791,103.42,147.74

### E. General queries

1. Who is at the top of the organization (i.e., reports to no one).

In [299]:
q =session.query(Employee).filter(Employee.reportsTo == None)

In [300]:
show_df_orm(q)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President

2. Who reports to William Patterson?

In [301]:
Boss = aliased(Employee)

q = session.query(Employee, func.concat(Boss.firstName," ", Boss.lastName).label("Boss Name"))\
         .join(Boss, Employee.reportsTo == Boss.employeeNumber)\
         .filter(and_(Boss.firstName == "William",Boss.lastName == "Patterson"))

In [302]:
show_df_orm(q)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,Boss Name
0,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088,Sales Rep,William Patterson
1,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088,Sales Rep,William Patterson
2,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088,Sales Rep,William Patterson

3. List all the products purchased by Herkku Gifts.

In [303]:
q = session.query(Product.productName)\
         .join(Orderdetail, Product.productCode == Orderdetail.productCode)\
         .join(Order, Order.orderNumber == Orderdetail.orderNumber)\
         .join(Customer, Customer.customerNumber == Order.customerNumber)\
         .filter(Customer.customerName == "Herkku Gifts")

In [304]:
show_df_orm(q)

                                  productName
0                           1968 Ford Mustang
1                          1968 Dodge Charger
2                     1970 Plymouth Hemi Cuda
3                          1969 Dodge Charger
4                             1993 Mazda RX-7
5                       1965 Aston Martin DB5
6                 1948 Porsche 356-A Roadster
7                            1995 Honda Civic
8                1999 Indy 500 Monte Carlo SS
9                 1992 Ferrari 360 Spider red
10                       1969 Dodge Super Bee
11                      1976 Ford Gran Torino
12             1948 Porsche Type 356 Roadster
13                  1966 Shelby Cobra 427 S/C
14                    1982 Lamborghini Diablo
15                  1971 Alpine Renault 1600s
16                    1956 Porsche 356A Coupe
17      1969 Harley Davidson Ultimate Chopper
18                      1996 Moto Guzzi 1100i
19       2003 Harley-Davidson Eagle Drag Bike
20        1936 Harley Davidson El Knucklehead
21                          1997 BMW R 1100 S
22                   1960 BSA Gold Star DBD34
23                           1997 BMW F650 ST
24                              ATA: B757-300
25                       1937 Lincoln Berline
26   1936 Mercedes-Benz 500K Special Roadster
27                     1928 Mercedes-Benz SSK
28  1938 Cadillac V-16 Presidential Limousine

4. Compute the commission for each sales representative, assuming the commission is 5% of the value of an order. Sort by employee last name and first name.

In [305]:
cummulative = func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered * 0.05)

q = session.query(Employee.lastName, Employee.firstName, func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered * 0.05))\
    .join(Customer, Employee.employeeNumber == Customer.salesRepEmployeeNumber)\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .group_by(Employee.employeeNumber)\
    .order_by(Employee.lastName.desc(), Employee.firstName.desc())

In [306]:
show_df_orm(q)

     lastName firstName       sum_1
0      Vanauf    George  33468.8525
1       Tseng  Foon Yue  24410.6335
2    Thompson    Leslie  17376.6515
3   Patterson     Steve  25293.7710
4       Nishi      Mami  22855.5035
5       Marsh     Peter  29229.6880
6       Jones     Barry  35242.6955
7    Jennings    Leslie  54076.5270
8   Hernandez    Gerard  62928.8905
9      Gerard    Martin  19373.8735
10     Fixter      Andy  28129.1295
11   Firrelli     Julie  19333.1600
12   Castillo    Pamela  43411.0275
13       Bott     Larry  36604.8395
14     Bondur      Loui  28474.2875

5. What is the difference in days between the most recent and oldest order date in the Orders file?

In [307]:
oldest = func.min(Order.orderDate)
recent = func.max(Order.orderDate)

In [308]:
q = session.query(func.datediff(recent, oldest))

In [309]:
print(q.scalar())

876

6. Compute the average time between order date and ship date for each customer ordered by the largest difference.

In [310]:
days_delay = func.sum(func.datediff(Order.shippedDate, Order.orderDate))

q = session.query(Customer.customerName, (days_delay/func.count(Order.orderDate)))\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .group_by(Customer.customerNumber)\
    .order_by((days_delay/func.count(Order.orderDate)).desc())

In [311]:
show_df_orm(q)

                          customerName   anon_1
0              Dragon Souveniers, Ltd.  14.6000
1                 Osaka Souveniers Co.   7.5000
2                          Mini Caravy   5.6667
3              Auto-Moto Classics Inc.   5.6667
4              Tokyo Collectables, Ltd   5.5000
..                                 ...      ...
93               UK Collectables, Ltd.   1.6667
94                   Gifts4AllAges.com   1.6667
95                   Land of Toys Inc.   1.5000
96  Bavarian Collectables Imports, Co.   1.0000
97                          Petit Auto   0.6667

[98 rows x 2 columns]

7. What is the value of orders shipped in August 2004? ([Hint](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html)).

In [312]:
value_each = Orderdetail.priceEach * Orderdetail.quantityOrdered
year = extract('YEAR', Order.shippedDate)
month = extract('MONTH', Order.shippedDate)

q = session.query(func.sum(value_each))\
    .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
    .where(and_(month == 8, year == 2004))

In [313]:
print(q.scalar())

355964.29

8. Compute the total value ordered, total amount paid, and their difference for each customer for orders placed in 2004 and payments received in 2004 (Hint; Create views for the total paid and total ordered).

In [314]:
order_2004 = select(Customer.customerName.label('customerName'), func.sum(Orderdetail.quantityOrdered * Orderdetail.priceEach).label('totalOrderValue'))\
             .join(Order, Customer.customerNumber == Order.customerNumber, isouter=True)\
             .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
             .where(extract('Year', Order.orderDate) == 2004)\
             .group_by(Customer.customerName).alias('order_2004')

In [315]:
payment_2004 = select(Customer.customerName.label('customerName'), func.sum(Payment.amount).label('totalPayment'))\
               .join(Payment, Customer.customerNumber == Payment.customerNumber, isouter=True)\
               .where(extract('Year', Payment.paymentDate) == 2004)\
               .group_by(Customer.customerName).alias('payment_2004')

In [316]:
q = session.query(order_2004.c.customerName, order_2004.c.totalOrderValue, payment_2004.c.totalPayment, (order_2004.c.totalOrderValue-payment_2004.c.totalPayment).label('difference'))\
                     .join(payment_2004, order_2004.c.customerName == payment_2004.c.customerName)

In [317]:
show_df_orm(q)

                      customerName  totalOrderValue  totalPayment  difference
0                Atelier graphique          7742.92       7742.92         0.0
1               Signal Gift Stores         47539.00      47539.00         0.0
2       Australian Collectors, Co.        127155.96     127155.96         0.0
3                La Rochelle Gifts         67426.01      67426.01         0.0
4               Baane Mini Imports         52514.46      52514.46         0.0
..                             ...              ...           ...         ...
83    Motor Mint Distributors Inc.         51893.45      51893.45         0.0
84        Signal Collectibles Ltd.         12573.28      12573.28         0.0
85  Double Decker Gift Stores, Ltd          7310.42       7310.42         0.0
86            Diecast Collectables          6276.60       6276.60         0.0
87               Kelly's Gift Shop         52166.00      52166.00         0.0

[88 rows x 4 columns]

9. List the employees who report to those employees who report to Diane Murphy. Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [318]:
leader = aliased(Employee)
coleader = aliased(Employee)

In [319]:
q = session.query(func.concat(Employee.firstName,' ', Employee.lastName).label('Fullname'))\
         .join(coleader, Employee.reportsTo == coleader.employeeNumber)\
         .filter(Employee.reportsTo.in_(\
                                       session.query(coleader.employeeNumber)\
                                       .join(leader, coleader.reportsTo == leader.employeeNumber)\
                                       .filter(leader.reportsTo == None)
                                       ))

In [320]:
show_df_orm(q)

            Fullname
0  William Patterson
1      Gerard Bondur
2        Anthony Bow
3         Mami Nishi

10. What is the percentage value of each product in inventory sorted by the highest percentage first (Hint: Create a view first).

In [321]:
inventory_stock = session.query(func.sum(Product.quantityInStock)).scalar()

In [322]:
q = session.query(Product.productCode, Product.productName, func.concat((Product.quantityInStock/inventory_stock)*100,"%").label('quantityPercentage'))\
    .order_by(((Product.quantityInStock/inventory_stock)*100).desc())

In [323]:
show_df_orm(q)

    productCode                     productName quantityPercentage
0      S12_2823                2002 Suzuki XREO            1.8008%
1      S18_1984                1995 Honda Civic            1.7603%
2     S700_2466  America West Airlines B757-200            1.7389%
3      S24_3432             2002 Chevy Corvette            1.7016%
4      S18_2325       1932 Model A Ford J-Coupe            1.6850%
..          ...                             ...                ...
105    S72_3212                      Pont Yacht            0.0746%
106    S32_1374                1997 BMW F650 ST            0.0321%
107    S32_4289        1928 Ford Phaeton Deluxe            0.0245%
108    S12_1099               1968 Ford Mustang            0.0122%
109    S24_2000        1960 BSA Gold Star DBD34            0.0027%

[110 rows x 3 columns]

11. Write a function to convert miles per gallon to liters per 100 kilometers.

In [324]:
def mpg_to_lkm(mpg):
  return 235.21 / mpg

12. Write a procedure to increase the price of a specified product category by a given percentage. You will need to create a product table with appropriate data to test your procedure. Alternatively, load the ClassicModels database on your personal machine so you have complete access. You have to change the [DELIMITER](http://dev.mysql.com/doc/refman/5.1/en/stored-programs-defining.html) prior to creating the procedure.

In [325]:
q = text("UPDATE products SET MSRP = MSRP * :x WHERE  productLine = :y")

print(q)

UPDATE products SET MSRP = MSRP * :x WHERE  productLine = :y

13. What is the value of orders shipped in August 2004? ([Hint](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html)).

In [326]:
value_each = Orderdetail.priceEach * Orderdetail.quantityOrdered
year = extract('YEAR', Order.shippedDate)
month = extract('MONTH', Order.shippedDate)

In [327]:
q = session.query(func.sum(value_each))\
    .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
    .where(and_(month == 8,year == 2004))

In [328]:
print(q.scalar())

355964.29

14. What is the ratio the value of payments made to orders received for each month of 2004. (i.e., divide the value of payments made by the orders received)?

In [329]:
order_count_2004 = select(func.month(Order.orderDate).label('Month'), func.count(Order.orderNumber).label('Count'))\
            .where(extract('YEAR',Order.orderDate) == 2004)\
            .group_by(func.month(Order.orderDate))\
            .order_by(asc(func.month(Order.orderDate)))\
            .alias('order_count_2004')

q = session.query(func.month(Payment.paymentDate).label('mont'),func.sum(Payment.amount).label('payment'),order_count_2004.c.Count.label('orderReceived'), (func.sum(Payment.amount)/order_count_2004.c.Count).label('ratio') )\
    .where(extract('YEAR',Payment.paymentDate) == 2004)\
    .group_by(func.month(Payment.paymentDate))\
    .order_by(asc(func.month(Payment.paymentDate)))\
    .join(order_count_2004, func.month(Payment.paymentDate) == order_count_2004.c.Month)

In [330]:
show_df_orm(q)

    mont    payment  orderReceived         ratio
0      1  234152.13              8  29269.016250
1      2  106652.01             11   9695.637273
2      3  404603.21              8  50575.401250
3      4  173245.96             10  17324.596000
4      5  208524.42              8  26065.552500
5      6  185842.86             12  15486.905000
6      7  284191.48             11  25835.589091
7      8  378094.30             12  31507.858333
8      9  476445.53             12  39703.794167
9     10  185103.43             13  14238.725385
10    11  857187.30             33  25975.372727
11    12  819285.62             13  63021.970769

15. What is the difference in the amount received for each month of 2004 compared to 2003?

In [331]:
year_2004 = select([func.month(Payment.paymentDate).label('Month'), func.sum(Payment.amount).label('Amount')])\
            .where(extract('YEAR',Payment.paymentDate) == 2004)\
            .group_by(func.month(Payment.paymentDate))\
            .order_by(asc(func.month(Payment.paymentDate)))\
            .alias('year_2004')

q = session.query(func.month(Payment.paymentDate).label('month'), year_2004.c.Amount.label('amountReceived2004'), func.sum(Payment.amount).label('amountReceived2003'), (year_2004.c.Amount - func.sum(Payment.amount)).label('difference'))\
    .where(extract('YEAR',Payment.paymentDate) == 2003)\
    .group_by(func.month(Payment.paymentDate))\
    .order_by(asc(func.month(Payment.paymentDate)))\
    .join(year_2004, func.month(Payment.paymentDate) == year_2004.c.Month)

In [332]:
show_df_orm(q)

    month  amountReceived2004  amountReceived2003  difference
0       1           234152.13            26267.62   207884.51
1       2           106652.01           144384.36   -37732.35
2       3           404603.21           199704.48   204898.73
3       4           173245.96           136313.92    36932.04
4       5           208524.42           159881.97    48642.45
5       6           185842.86           180218.98     5623.88
6       7           284191.48           158247.00   125944.48
7       8           378094.30           246204.86   131889.44
8       9           476445.53           161206.23   315239.30
9      10           185103.43           316857.96  -131754.53
10     11           857187.30           694292.68   162894.62
11     12           819285.62           826637.64    -7352.02

16. Write a procedure to report the amount ordered in a specific month and year for customers containing a specified character string in their name.

In [333]:
q = session.query(Customer.customerNumber, Customer.customerName, func.sum(Orderdetail.quantityOrdered).label('Amount Ordered'))\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .where(and_(\
                Customer.customerName.like("%s%"),\
                extract('MONTH', Order.orderDate) == 8,\
                extract('YEAR', Order.orderDate) == 2004,\
                ))\
    .group_by(Customer.customerNumber)

In [334]:
show_df_orm(q)

    customerNumber                       customerName  Amount Ordered
0              112                 Signal Gift Stores           318.0
1              124       Mini Gifts Distributors Ltd.           447.0
2              141             Euro+ Shopping Channel           236.0
3              148            Dragon Souveniers, Ltd.            28.0
4              157              Diecast Classics Inc.           449.0
5              204           Online Mini Collectables           527.0
6              249                 Amica Models & Co.           551.0
7              260  Royal Canadian Collectables, Ltd.           483.0
8              286               Marta's Replicas Co.           474.0
9              298                    Vida Sport, Ltd           595.0
10             299          Norway Gifts By Mail, Co.           418.0

17. Write a procedure to change the credit limit of all customers in a specified country by a specified percentage.

In [335]:
s = text("UPDATE customers SET creditLimit = creditLimit * :x WHERE  country = :y")
print(s)

UPDATE customers SET creditLimit = creditLimit * :x WHERE  country = :y

18. **Basket of goods analysis**: A common retail analytics task is to analyze each basket or order to learn what products are often purchased together. Report the names of products that appear in the same order ten or more times.

In [336]:
q = session.query(Product.productCode, Product.productName, Orderdetail.orderNumber)\
    .join(Orderdetail, Product.productCode == Orderdetail.productCode)\
    .where(Orderdetail.quantityOrdered >= 10)\
    .group_by(Orderdetail.productCode)

In [337]:
show_df_orm(q)

    productCode                          productName  orderNumber
0      S18_1749             1917 Grand Touring Sedan        10100
1      S18_2248                   1911 Ford Town Car        10100
2      S18_4409  1932 Alfa Romeo 8C2300 Spider Sport        10100
3      S24_3969     1936 Mercedes Benz 500k Roadster        10100
4      S18_2325            1932 Model A Ford J-Coupe        10101
..          ...                                  ...          ...
104    S24_1628            1966 Shelby Cobra 427 S/C        10110
105    S24_2766                   1949 Jaguar XK 120        10110
106    S24_2887                    1952 Citroen-15CV        10110
107    S24_3191            1969 Chevrolet Camaro Z28        10110
108    S24_3432                  2002 Chevy Corvette        10110

[109 rows x 3 columns]

19. **ABC reporting**: Compute the revenue generated by each customer based on their orders. Also, show each customer's revenue as a percentage of total revenue. Sort by customer name.

In [338]:
cummulative = func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered).label('revenue')

total_revenue = session.query(cummulative).scalar()

In [339]:
q = session.query(Customer.customerName, cummulative, func.concat((cummulative/total_revenue) * 100,"%").label('percentage'))\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .group_by(Customer.customerName)\
    .order_by(Customer.customerName.asc())

In [340]:
show_df_orm(q)

                    customerName    revenue percentage
0                   Alpha Cognac   60483.36  0.629760%
1             Amica Models & Co.   82223.23  0.856118%
2        Anna's Decorations, Ltd  137034.22  1.426817%
3              Atelier graphique   22314.36  0.232340%
4   Australian Collectables, Ltd   55866.02  0.581684%
..                           ...        ...        ...
93         UK Collectables, Ltd.  106610.72  1.110044%
94               Vida Sport, Ltd  108777.92  1.132609%
95               Vitachrome Inc.   72497.64  0.754854%
96      Volvo Model Replicas, Co   66694.82  0.694435%
97   West Coast Collectables Co.   43748.72  0.455517%

[98 rows x 3 columns]

20. Compute the profit generated by each customer based on their orders. Also, show each customer's profit as a percentage of total profit. Sort by profit descending.

In [341]:
cummulative = func.sum((Orderdetail.priceEach * Orderdetail.quantityOrdered) -(Product.buyPrice * Orderdetail.quantityOrdered) )

In [342]:
total_profit = session.query(cummulative).scalar()

In [343]:
q = session.query(Customer.customerName, cummulative.label('profit'), func.concat((cummulative/total_profit) * 100,"%").label('profitPercentage') )\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .group_by(Customer.customerName)\
    .order_by((cummulative/total_profit).desc())

In [344]:
show_df_orm(q)

                          customerName       profit profitPercentage
0               Euro+ Shopping Channel  34468024.71        8.108041%
1         Mini Gifts Distributors Ltd.  27010237.38        6.353718%
2                   Muscle Machine Inc   8949875.25        2.105312%
3           Australian Collectors, Co.   8340194.48        1.961895%
4              Dragon Souveniers, Ltd.   8068805.02        1.898055%
..                                 ...          ...              ...
93  Bavarian Collectables Imports, Co.   1044738.43        0.245758%
94                     Microscale Inc.    935645.23        0.220095%
95                   Atelier graphique    839042.70        0.197371%
96             Auto-Moto Classics Inc.    653712.71        0.153775%
97                   Boards & Toys Co.    260732.06        0.061333%

[98 rows x 3 columns]

21. Compute the revenue generated by each sales representative based on the orders from the customers they serve.

In [345]:
cummulative = func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered)

q = session.query(Employee.lastName, Employee.firstName, cummulative.label('revenue'))\
    .join(Customer, Employee.employeeNumber == Customer.salesRepEmployeeNumber)\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .join(Product, Product.productCode == Orderdetail.productCode)\
    .group_by(Employee.employeeNumber)\
    .order_by(Employee.lastName.desc(), Employee.firstName.desc())

In [346]:
show_df_orm(q)

     lastName firstName     revenue
0      Vanauf    George   669377.05
1       Tseng  Foon Yue   488212.67
2    Thompson    Leslie   347533.03
3   Patterson     Steve   505875.42
4       Nishi      Mami   457110.07
5       Marsh     Peter   584593.76
6       Jones     Barry   704853.91
7    Jennings    Leslie  1081530.54
8   Hernandez    Gerard  1258577.81
9      Gerard    Martin   387477.47
10     Fixter      Andy   562582.59
11   Firrelli     Julie   386663.20
12   Castillo    Pamela   868220.55
13       Bott     Larry   732096.79
14     Bondur      Loui   569485.75

22. Compute the profit generated by each sales representative based on the orders from the customers they serve. Sort by profit generated descending.

In [347]:
cummulative = func.sum((Orderdetail.priceEach * Orderdetail.quantityOrdered) -(Product.buyPrice * Orderdetail.quantityOrdered) )

q = session.query(Employee.lastName, Employee.firstName, cummulative.label('profit'))\
    .join(Customer, Employee.employeeNumber == Customer.salesRepEmployeeNumber)\
    .join(Order, Customer.customerNumber == Order.customerNumber)\
    .join(Orderdetail, Order.orderNumber == Orderdetail.orderNumber)\
    .join(Product, Product.productCode == Orderdetail.productCode)\
    .group_by(Employee.employeeNumber)\
    .order_by(cummulative.desc())

In [348]:
show_df_orm(q)

     lastName firstName     profit
0   Hernandez    Gerard  504644.71
1    Jennings    Leslie  435208.35
2    Castillo    Pamela  340727.90
3        Bott     Larry  290203.59
4       Jones     Barry  276659.25
5      Vanauf    George  269596.09
6      Bondur      Loui  234891.07
7       Marsh     Peter  230811.75
8      Fixter      Andy  222207.18
9   Patterson     Steve  197879.23
10      Tseng  Foon Yue  194839.92
11      Nishi      Mami  181181.80
12     Gerard    Martin  156878.63
13   Firrelli     Julie  152119.31
14   Thompson    Leslie  138031.47

23. Compute the revenue generated by each product, sorted by product name.

In [349]:
cummulative = func.sum(Orderdetail.priceEach * Orderdetail.quantityOrdered).label('revenue')
q = session.query(func.distinct(Product.productName).label('productName'), cummulative)\
    .join(Orderdetail, Product.productCode == Orderdetail.productCode, isouter = True)\
    .group_by(Product.productName)\
    .order_by(Product.productName.asc())

In [350]:
show_df_orm(q)

                             productName    revenue
0                  18th century schooner  112427.12
1    18th Century Vintage Horse Carriage   85328.57
2                 1900s Vintage Bi-Plane   58434.07
3                1900s Vintage Tri-Plane   68276.35
4                      1903 Ford Model A  111528.82
..                                   ...        ...
105                        The Mayflower   69531.61
106                       The Queen Mary   78919.06
107                The Schooner Bluenose   56455.11
108                          The Titanic   84992.25
109            The USS Constitution Ship   66697.13

[110 rows x 2 columns]

24. Compute the profit generated by each product line, sorted by profit descending.

In [351]:
cummulative = func.sum((Orderdetail.priceEach * Orderdetail.quantityOrdered) - (Product.buyPrice * Orderdetail.quantityOrdered)).label('profit')

In [352]:
q = session.query(Productline.productLine, cummulative)\
    .join(Product, Productline.productLine == Product.productLine)\
    .join(Orderdetail, Product.productCode == Orderdetail.productCode, isouter=True)\
    .group_by(Productline.productLine)\
    .order_by(cummulative.desc())

In [353]:
show_df_orm(q)

        productLine      profit
0      Classic Cars  1526212.20
1      Vintage Cars   737268.33
2       Motorcycles   469255.30
3  Trucks and Buses   400553.22
4            Planes   365960.71
5             Ships   261289.47
6            Trains    65341.02

25. **Same as Last Year (SALY) analysis**: Compute the ratio for each product of sales for 2003 versus 2004.

In [354]:
product_2003 = select([Product.productCode, Product.productName, Orderdetail.quantityOrdered])\
               .join(Orderdetail, Product.productCode == Orderdetail.productCode, isouter=True)\
               .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
               .where(extract('YEAR', Order.orderDate)==2003)\
               .group_by(Product.productCode).alias("product_2003")

product_2004 = select([Product.productCode, Product.productName, Orderdetail.quantityOrdered])\
               .join(Orderdetail, Product.productCode == Orderdetail.productCode, isouter=True)\
               .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
               .where(extract('YEAR', Order.orderDate)==2004)\
               .group_by(Product.productCode).alias("product_2004")

In [355]:
q = session.query(product_2003.c.productCode, product_2003.c.productName, product_2003.c.quantityOrdered.label("quantityOrdered2003"), product_2004.c.quantityOrdered.label("quantityOrdered2004"), func.concat(product_2003.c.quantityOrdered,"/",product_2004.c.quantityOrdered).label('ratio(2003/2004)'))\
                .join(product_2004, product_2003.c.productCode == product_2004.c.productCode)

In [356]:
show_df_orm(q)

,productCode,productName,quantityOrdered2003,quantityOrdered2004,ratio(2003/2004)
0,S18_1749,1917 Grand Touring Sedan,30,30,30/30
1,S18_2248,1911 Ford Town Car,50,21,50/21
2,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport,22,38,22/38
3,S24_3969,1936 Mercedes Benz 500k Roadster,49,44,49/44
4,S18_2325,1932 Model A Ford J-Coupe,25,27,25/27
...,...,...,...,...,...
104,S24_1628,1966 Shelby Cobra 427 S/C,29,45,29/45
105,S24_2766,1949 Jaguar XK 120,43,45,43/45
106,S24_2887,1952 Citroen-15CV,46,27,46/27
107,S24_3191,1969 Chevrolet Camaro Z28,27,27,27/27
108,S24_3432,2002 Chevy Corvette,37,46,37/46

26. Compute the ratio of payments for each customer for 2003 versus 2004.

In [357]:
payment_2003 = select([Customer.customerNumber.label('customerNumber'), Customer.customerName.label('customerName'), func.count(Payment.checkNumber).label('payment_count')])\
               .join(Payment, Customer.customerNumber == Payment.customerNumber, isouter=True)\
               .where(func.year(Payment.paymentDate) == 2003)\
               .group_by(Customer.customerNumber).alias('payment_2003')

payment_2004 = select([Customer.customerNumber.label('customerNumber'), Customer.customerName.label('customerName'), func.count(Payment.checkNumber).label('payment_count')])\
               .join(Payment, Customer.customerNumber == Payment.customerNumber, isouter=True)\
               .where(func.year(Payment.paymentDate) == 2004)\
               .group_by(Customer.customerNumber).alias('payment_2004')

In [358]:
q = session.query(payment_2003.c.customerNumber, payment_2003.c.customerName, payment_2003.c.payment_count.label('payment_count_2003'), payment_2004.c.payment_count.label('payment_count_2004'), func.concat(payment_2003.c.payment_count,"/",payment_2004.c.payment_count).label('ratio'))\
                .join(payment_2004, payment_2003.c.customerNumber == payment_2004.c.customerNumber)

In [359]:
show_df_orm(q)

,customerNumber,customerName,payment_count_2003,payment_count_2004,ratio
0,103,Atelier graphique,1,2,1/2
1,112,Signal Gift Stores,1,2,1/2
2,114,"Australian Collectors, Co.",2,2,2/2
3,121,Baane Mini Imports,2,2,2/2
4,124,Mini Gifts Distributors Ltd.,3,4,3/4
...,...,...,...,...,...
58,486,Motor Mint Distributors Inc.,1,2,1/2
59,487,Signal Collectibles Ltd.,1,1,1/1
60,489,"Double Decker Gift Stores, Ltd",1,1,1/1
61,495,Diecast Collectables,1,1,1/1
62,496,Kelly's Gift Shop,1,1,1/1

27. Find the products sold in 2003 but not 2004.

In [360]:
sold_2004 = select([Product.productCode])\
            .join(Orderdetail, Product.productCode == Orderdetail.productCode, isouter=True)\
            .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
            .where(and_(\
                        Order.status == "Resolved",\
                        extract('YEAR',Order.orderDate) == 2004\
                        ))\
            .group_by(Product.productCode).alias('sold_2004')

In [361]:
sold_2003 = select([Product.productCode, Product.productName, Order.status ])\
            .join(Orderdetail,  Product.productCode == Orderdetail.productCode, isouter=True)\
            .join(Order, Orderdetail.orderNumber == Order.orderNumber)\
            .where(and_(\
                        Order.status == "Resolved",\
                        extract('YEAR',Order.orderDate) == 2003\
                        ))\
            .group_by(Product.productCode).alias('sold_2003')

In [362]:
q = session.query(sold_2003.c.productCode, sold_2003.c.productName)\
         .filter(sold_2003.c.productCode.not_in(sold_2004))

In [363]:
show_df_orm(q)

  productCode                                  productName
0    S10_4962                       1962 LanciaA Delta 16V
1    S12_1666                               1958 Setra Bus
2    S18_1097                       1940 Ford Pickup Truck
3    S18_4600                             1940s Ford truck
4    S18_4668                      1939 Cadillac Limousine
5    S32_1268                  1980’s GM Manhattan Express
6    S32_3522  1996 Peterbilt 379 Stake Bed with Outrigger
7   S700_2824                              1982 Camaro Z28

28. Find the customers without payments in 2003.

In [364]:
year = extract('YEAR', Payment.paymentDate)
q = session.query(func.distinct(Customer.customerNumber).label('customerNumber'), Customer.customerName)\
    .join(Payment, Customer.customerNumber == Payment.customerNumber)\
    .filter(Customer.customerNumber.not_in(\
                       session.query(Customer.customerNumber)\
                       .join(Payment, Customer.customerNumber == Payment.customerNumber)\
                       .filter(year == 2003)
                       ))

In [365]:
show_df_orm(q)

    customerNumber                        customerName
0              119                   La Rochelle Gifts
1              157               Diecast Classics Inc.
2              166                    Handji Gifts& Co
3              173          Cambridge Collectables Co.
4              177                Osaka Souveniers Co.
5              189             Clover Collections, Co.
6              204            Online Mini Collectables
7              209                         Mini Caravy
8              239        Collectable Mini Designs Co.
9              240                   giftsbymail.co.uk
10             249                  Amica Models & Co.
11             256                Auto Associés & Cie.
12             260   Royal Canadian Collectables, Ltd.
13             286                Marta's Replicas Co.
14             298                     Vida Sport, Ltd
15             314                          Petit Auto
16             328             Tekni Collectables Inc.
17             362                   Gifts4AllAges.com
18             398             Tokyo Collectables, Ltd
19             406                   Auto Canal+ Petit
20             412       Extreme Desk Decorations, Ltd
21             415  Bavarian Collectables Imports, Co.
22             448             Scandinavian Gift Ideas
23             450           The Sharp Gifts Warehouse
24             456                     Microscale Inc.

### Correlated subqueries

1. Who reports to Mary Patterson?

In [366]:
report_to = 'Mary Patterson'

report_to_en= session.query(Employee.employeeNumber)\
        .filter(Employee.firstName==func.substring_index(report_to, ' ', 1), Employee.lastName==func.substring_index(report_to, ' ', -1))\
        .subquery()

In [367]:
q = session.query(func.concat(Employee.firstName, ' ', Employee.lastName).label('employee'))\
        .filter(Employee.reportsTo==report_to_en)

In [368]:
show_df_orm(q)

            employee
0  William Patterson
1      Gerard Bondur
2        Anthony Bow
3         Mami Nishi

2. Which payments in any month and year are more than twice the average for that month and year (i.e. compare all payments in Oct 2004 with the average payment for Oct 2004)? Order the results by the date of the payment. You will need to use the [date functions](http://dev.mysql.com/doc/refman/5.1/en/date-and-time-functions.html).

In [369]:
sub = (select(Payment, func.avg(Payment.amount).over(func.year(Payment.paymentDate),func.month(Payment.paymentDate)).label("avg_ym"))).alias("sub")

In [370]:
s = session.query(sub.c.checkNumber, sub.c.amount, sub.c.paymentDate, (2*sub.c.avg_ym)).filter(sub.c.amount>(2*sub.c.avg_ym)).order_by(sub.c.paymentDate)

In [371]:
show_df_orm(s)

   checkNumber     amount paymentDate        anon_1
0     IP568906   58841.35  2003-06-18  58398.022758
1     KI131716  111654.40  2003-08-15  58196.427442
2      DJ15149   85559.12  2003-11-03  60589.501500
3     GN228846   85024.46  2003-12-03  65004.354000
4     KM172879  105743.00  2003-12-26  65004.354000
5     NQ865547   80375.24  2004-03-15  64818.030434
6     EF485824   59551.38  2004-06-21  55873.216596
7     BG255406   85410.87  2004-08-28  58097.246176
8     NN711988   63357.13  2004-09-07  59078.359036
9     LF501133   61402.00  2004-09-18  59078.359036
10    MA765515   82261.22  2004-12-15  63431.297794
11     ID10962  116208.40  2004-12-31  63431.297794
12    AE215433  101244.59  2005-03-05  73814.987620
13    JE105477  120166.58  2005-03-18  73814.987620
14     ET64396   83598.04  2005-04-16  73765.776154
15    AL493079   75020.13  2005-05-23  70354.515428

3. Report for each product, the percentage value of its stock on hand as a percentage of the stock on hand for product line to which it belongs. Order the report by product line and percentage value within product line descending. Show percentages with two decimal places.

In [372]:
total_stock = select(Product.productLine, func.sum(Product.quantityInStock).label('totalQuantity'))\
              .group_by(Product.productLine)\
              .alias('total_stock')

q = session.query(Product.productCode, Product.productName, Product.quantityInStock, total_stock.c.productLine, total_stock.c.totalQuantity,\
           func.concat(func.round((Product.quantityInStock/total_stock.c.totalQuantity)*100,2)," ","%").label('percentage'))\
        .join(total_stock, Product.productLine == total_stock.c.productLine)\
        .order_by(Product.productLine.desc(), func.round((Product.quantityInStock/total_stock.c.totalQuantity)*100,2).desc())

In [373]:
show_df_orm(q)

,productCode,productName,quantityInStock,productLine,totalQuantity,percentage
0,S18_2325,1932 Model A Ford J-Coupe,9354,Vintage Cars,124880.0,7.49 %
1,S24_3151,1912 Ford Model T Delivery Wagon,9173,Vintage Cars,124880.0,7.35 %
2,S18_1342,1937 Lincoln Berline,8693,Vintage Cars,124880.0,6.96 %
3,S18_1367,1936 Mercedes-Benz 500K Special Roadster,8635,Vintage Cars,124880.0,6.91 %
4,S18_4522,1904 Buick Runabout,8290,Vintage Cars,124880.0,6.64 %
...,...,...,...,...,...,...
105,S24_2887,1952 Citroen-15CV,1452,Classic Cars,219183.0,0.66 %
106,S18_4721,1957 Corvette Convertible,1249,Classic Cars,219183.0,0.57 %
107,S12_3891,1969 Ford Falcon,1049,Classic Cars,219183.0,0.48 %
108,S24_1046,1970 Chevy Chevelle SS 454,1005,Classic Cars,219183.0,0.46 %
109,S12_1099,1968 Ford Mustang,68,Classic Cars,219183.0,0.03 %

4. For orders containing more than two products, report those products that constitute more than 50% of the value of the order.

In [374]:
order_summary = select(Orderdetail.orderNumber, func.count(Orderdetail.productCode).label('totalProduct'))\
                .group_by(Orderdetail.orderNumber).order_by(asc(Orderdetail.orderNumber)).alias('order_summary')

In [375]:
perfect_order = select(order_summary.c.orderNumber)\
                .where(order_summary.c.totalProduct > 2).alias('perfect_summary')

In [376]:
product_value = select(Orderdetail.orderNumber, Product.productName, (Orderdetail.quantityOrdered * Orderdetail.priceEach).label('value'))\
    .join(Product, Orderdetail.productCode == Product.productCode)\
    .where(Orderdetail.orderNumber.in_(perfect_order))\
    .order_by(Orderdetail.orderNumber).alias('product_value')

In [377]:
total_value = select(product_value.c.orderNumber, func.sum(product_value.c.value).label('totalValue'))\
    .group_by(product_value.c.orderNumber).alias('total_value')

In [378]:
q = session.query(product_value.c.orderNumber, product_value.c.productName, product_value.c.value, total_value.c.totalValue,\
           func.concat(func.round((product_value.c.value/total_value.c.totalValue)*100,2)," ","%").label("percentage")\
           )\
    .join(total_value, product_value.c.orderNumber == total_value.c.orderNumber)\
    .filter((product_value.c.value/total_value.c.totalValue) > 0.5)

In [379]:
show_df_orm(q)

   orderNumber                  productName    value  totalValue percentage
0        10166            1903 Ford Model A  5873.37     9977.85    58.86 %
1        10335  1980’s GM Manhattan Express  3390.20     6466.44    52.43 %
2        10199  American Airlines: B767-300  3901.92     7678.25    50.82 %